// -*- coding: utf_8 -*-
#include <iostream>
#include <fstream>
#include <string>
#include <vector>
#include <locale>
#include <codecvt>
#include <dirent.h>
using namespace std;

vector<string> ru_001; // Наречия времени (вчера, сегодня, недавно)
vector<string> ru_002; // Глаголы прошедшего времени с окончанием а/и (сказал(а/и), сообщил(а/и))
vector<string> ru_003; // Глаголы прошедшего времени с окончанием ла/ли (постиг(ла/ли), постриг(ла/ли))
vector<string> ru_004; // Глаголы прошедшего времени с окончанием ся/ась/ись (попал(ся/ась/ись), появил(ся/ась/ись))

void print(int item) {
	cout << item << endl;
}
void print(string text) {
	cout << text << endl;
}
void print(vector<string> arr) {
	cout << "Array: (" << endl;
	for (string item : arr) {
		cout << "  " << item << endl;
	}
	cout << ")" << endl;
}

wstring s2ws(const string& str) {
	using convert_typeX = codecvt_utf8<wchar_t>;
	wstring_convert<convert_typeX, wchar_t> converterX;
	return converterX.from_bytes(str);
}

string ws2s(const wstring& wstr) {
	using convert_typeX = codecvt_utf8<wchar_t>;
	wstring_convert<convert_typeX, wchar_t> converterX;
	return converterX.to_bytes(wstr);
}

int Count(string text, string sub) {
	int out = 0;
	int start = 0;
	int textlen = text.length();
	while (true) {
		start = text.find(sub, start) + sub.length();
		if (start <= 0 || start > textlen) {
			break;
		}
		else {
			out++;
		}
	}
	return out;
}

vector<string> Split(string text, char delimiter = ' ') {
	int start = 0;
	int end;
	int total;
	string buff;
	vector<string> arr;

	while (true) {
		end = text.find(delimiter, start);
		if (end < 0) {
			break;
		}
		total = end-start;
		buff = text.substr(start, total);
		arr.push_back(buff);
		start = end+1;
	}
	return arr;
}

string ReadFile(string fname) {
	ifstream file;
	string buffer;

	file.open(fname);
	if (file.is_open() == false) {
		cout << "Can't open file: " << fname << endl;
	}
	string content( (istreambuf_iterator<char>(file) ),
					(istreambuf_iterator<char>()     ) );
	return content;
}

string GetTitle(string content) {
	int start;
	int end;
	int total;
	string text;

	string str = "<h1>";
	start = content.find(str) + str.length();
	end = content.find("</h1>");
	total = end-start;
	text = content.substr(start, total);
	return text;
}

string GetClearText(string content) {
	int start;
	int end;
	int total;
	string text = content;

	while (true) {
		start = text.find('<');
		end = text.find('>')+1;
		if (start < 0) {
			break;
		}
		total = end-start;
		text.erase(start, total);
	}
	return text;
}

string GetClearWord(string word) {
	int start;

	while (true) {
		start = word.find('"');
		if (start < 0) {
			break;
		}
		word.erase(start, 1);
	}
	return word;
}

vector<string> GetWords(string text) {
	vector<string> output;
	vector<string> arr = Split(text);

	for (string word : arr) {
		if (word.length() >= 3) {
			word = GetClearWord(word);
			output.push_back(word);
		}
	}
	return output;
}

string GetLanguage(vector<string> words) {
	int i = 0;
	int ru = 0;
	int en = 0;
	int other = 0;
	int wordslen = words.size();

	for (string item : words) {
		if (ru > wordslen/2 || en > wordslen/2 || other > wordslen/2) {
			break;
		}

		wstring wsitem = s2ws(item);
		if (wsitem[i] >= L'А' && wsitem[i] <= L'Я' || wsitem[i] >= L'а' && wsitem[i] <= L'я') {
			ru++;
		}
		else if (wsitem[i] >= 'A' && wsitem[i] <= 'Z' || wsitem[i] >= 'a' && wsitem[i] <= 'z') {
			en++;
		}
		else {
			other++;
		}
	}
	if (ru > en && ru > other) {
		return "ru";
	}
	if (en > ru && en > other) {
		return "en";
	}
	if (other > ru && other > en) {
		return "--";
	}
}

string as(string dirname) {
	int a = dirname.size()-1;
	char s = dirname[a];
	if (s != '/') {
		dirname.append("/");
	}
	return dirname;
}

vector<string> OpenDirectory(string dirname, string mod) {
	vector<string> output;

	const char *c_dirname = dirname.c_str();
	DIR *dir = opendir(c_dirname);
	if (dir) {
		struct dirent *ent;
		while ((ent = readdir(dir)) != NULL) {
			dirname = ent->d_name;
			if (dirname != "." && dirname != "..") {
				int a = dirname.find(".");
				if (a < 0 && mod == "dirs") {
					output.push_back(dirname);
				}
				else if (a > 0 && mod == "files") {
					output.push_back(dirname);
				}
			}
		}
		closedir(dir);
	}
	else {
		string error_msg = "Error opening directory: ";
		print(error_msg.append(dirname));
	}
	return output;
}

vector<string> ReadDirectory(string dirname) {
	vector<string> buff;
	vector<string> buff2;
	vector<string> output;

	buff = OpenDirectory(dirname, "files");
	for (string item : buff) {
		output.push_back(as(dirname).append(item));
	}

	buff = OpenDirectory(dirname, "dirs");
	for (string item : buff) {
		string dirname2 = as(dirname);
		dirname2 = dirname2.append(item);
		buff2 = ReadDirectory(dirname2);
		for (string item2 : buff2) {
			output.push_back(item2);
		}
	}
	return output;
}

void ReadRuDatabase() {
	ru_001 = {"недавно", "вчера", "сегодня", "сейчас", "накануне", "раньше", "позже", "теперь", "на этой неделе", "на прошлой недедле", "в эту неделю", "в этот месяц", "в этом месяце", "в этом году",  "в понедельник", "во вторник", "в cреду", "в четверг", "в пятницу", "в субботу", "в воскресенье"};
	ru_002 = {"арестовал", "бегал", "бежал", "беседовал", "беспокоил", "бил", "благодарил", "блестел", "болел", "бормотал", "брал", "бродил", "бросал", "бросил", "бывал", "был", "валял", "варил", "ввел", "вводил", "вел", "велел", "верил", "вернул", "взвесил", "взглянул", "вздохнул", "взял", "видал", "видел", "висел", "включал", "включил", "владел", "влиял", "вложил", "вносил", "водил", "воевал", "возвращал", "возглавлял", "возникал", "возникнул", "возражал", "возразил", "волновал", "воскликнул", "воспринял", "восстановил", "врал", "вскочил", "вскрыл", "вспоминал", "вспомнил", "вставал", "встал", "встретил", "встречал", "вступал", "вступил", "входил", "выбирал", "выбрал", "выбросил", "вывел", "выглядел", "выдавал", "выдал", "выделил", "выделял", "выдержал", "выжил", "вызвал", "вызывал", "выиграл", "выносил", "вынудил", "вынул", "выпал", "выпил", "выполнил", "выполнял", "выпрыгнул", "выпускал", "выпустил", "выражал", "выразил", "вырастил", "вырвал", "вырезал", "высказал", "выскочил", "выслушал", "выставил", "выступал", "выступил", "вытащил", "вытянул", "выявил", "выяснил", "гарантировал", "гибнул", "глядел", "глянул", "гнал", "гнул", "говорил", "горел", "готовил", "грозил", "гулял", "давал", "дал", "дарил", "двигал", "двинул", "действовал", "делал", "делил", "демонстрировал", "держал", "добавил", "добавлял", "добивал", "добил", "добрал", "довел", "доверял", "договорил", "доказал", "доказывал", "доложил", "допускал", "допустил", "дослужил", "доставал", "доставил", "достал", "достигал", "достигнул", "доходил", "дрожал", "дружил", "думал", "дышал", "ездил", "ехал", "жалел", "жаловал", "ждал", "желал", "женил", "жил", "забирал", "заболел", "заботил", "забрал", "забывал", "забыл", "завел", "завернул", "завершил", "завивал", "зависел", "заглядывал", "заглянул", "загнул", "заговорил", "задавал", "задал", "задержал", "задумал", "задумывал", "заинтересовал", "заказал", "заказывал", "заканчивал", "заключал", "заключил", "закончил", "закричал", "закрывал", "закрыл", "закурил", "заложил", "заменил", "замерил", "заметил", "замечал", "замолчал", "занимал", "занял", "записал", "записывал", "заплакал", "заплатил", "заполнил", "запомнил", "запретил", "запрыгнул", "зарабатывал", "заработал", "зарегистрировал", "заслужил", "засмеял", "заснул", "заставил", "заставлял", "застрелил", "заступил", "засыпал", "захватил", "заходил", "захотел", "зачитал", "защитил", "защищал", "заявил", "заявлял", "звал", "звонил", "звучал", "здравствовал", "знал", "значил", "играл", "избавил", "избежал", "избрал", "извинил", "издавал", "издал", "изложил", "изменил", "изображал", "изобразил", "изучал", "изучил", "имел", "интересовал", "искал", "исключил", "исполнил", "исполнял", "использовал", "исправил", "испугал", "испытал", "испытывал", "исследовал", "исходил", "исчез", "исчезал", "кивал", "кивнул", "кинул", "клал", "командовал", "контролировал", "кончал", "кончил", "кормил", "крикнул", "кричал", "крутил", "купил", "курил", "курировал", "лежал", "летал", "летел", "лечил", "лишил", "ловил", "ломал", "любил", "махнул", "менял", "мечтал", "мешал", "минировал", "миновал", "молил", "молчал", "мучил", "мыл", "набирал", "наблюдал", "набрал", "надел", "надоел", "назвал", "назначил", "называл", "налетал", "налил", "напечатал", "написал", "наполнил", "напоминал", "напомнил", "направил", "нарисовал", "нарушал", "нарушил", "настаивал", "наступал", "наступил", "научил", "находил", "начал", "начинал", "ненавидел", "носил", "обернул", "обеспечивал", "обеспечил", "обещал", "обидел", "обладал", "обманул", "обнаружил", "обнял", "обобрал", "обозначил", "обрадовал", "образовал", "образовывал", "обратил", "обращал", "обрел", "обсмеял", "обсудил", "обсуждал", "обусловил", "объединил", "объявил", "объяснил", "объяснял", "обязал", "оглянул", "ограничил", "одевал", "одел", "ожидал", "означал", "оказал", "оказывал", "окончил", "окрикнул", "окружал", "окружил", "опередил", "описал", "описывал", "определил", "определял", "опубликовал", "опустил", "орал", "организовал", "осветил", "освободил", "освоил", "основал", "основывал", "оставил", "оставлял", "останавливал", "остановил", "осуществил", "осуществлял", "отвел", "отвернул", "ответил", "отвечал", "отдавал", "отдал", "отдохнул", "отдыхал", "отказал", "отказывал", "открывал", "открыл", "отличал", "отложил", "отменил", "отметил", "отмечал", "относил", "отобрал", "отозвал", "оторвал", "отправил", "отправлял", "отпустил", "отражал", "отрезал", "отсутствовал", "отчитал", "оформил", "охватил", "оценивал", "оценил", "ощутил", "ощущал", "падал", "пахнул", "пел", "перебил", "перевел", "перевернул", "переводил", "перегнул", "переговорил", "передавал", "передал", "переехал", "переживал", "пережил", "переиграл", "перекладывал", "перекрыл", "перелетел", "переложил", "перепечатал", "перепрыгнул", "перерабатывал", "перерешал", "пересмотрел", "переставал", "перестал", "переступил", "пересчитал", "перетанцевал", "переходил", "перечеркнул", "перечитал", "пил", "писал", "плавал", "плакал", "планировал", "платил", "плыл", "побегал", "победил", "побежал", "побрил", "побывал", "повел", "поверил", "повернул", "повесил", "повторил", "повторял", "повысил", "погадал", "поглядел", "поглядывал", "поговорил", "погулял", "подавал", "подал", "подарил", "подвел", "подготовил", "поддавал", "поддержал", "поддерживал", "поделил", "подлежал", "поднимал", "поднял", "подобрал", "подождал", "подозревал", "подписал", "подтвердил", "подтверждал", "подумал", "подхватил", "подходил", "подчеркивал", "подчеркнул", "поехал", "пожалел", "пожелал", "позвал", "позволил", "позволял", "позвонил", "поздравил", "поздравлял", "познавал", "познакомил", "поймал", "показал", "показывал", "покачал", "покинул", "покрыл", "покупал", "полагал", "полетел", "положил", "получал", "получил", "полюбил", "помешал", "помнил", "помог", "помогал", "помолчал", "понимал", "понял", "пообещал", "попадал", "попал", "попробовал", "попросил", "попытал", "поразил", "порешал", "поручил", "посадил", "посвятил", "посетил", "посещал", "посидел", "послал", "последовал", "послушал", "посмотрел", "посоветовал", "поставил", "постоял", "пострадал", "построил", "поступал", "поступил", "посылал", "потанцевал", "потерял", "потратил", "потребовал", "потянул", "походил", "похорошел", "поцеловал", "почитал", "почувствовал", "пошл", "пояснил", "превратил", "превращал", "превышал", "предвидел", "предлагал", "предложил", "предназначил", "предоставил", "предоставлял", "предотвратил", "предполагал", "предположил", "предпочитал", "представил", "представлял", "предстоял", "предупредил", "предупреждал", "предусматривал", "предусмотрел", "предъявил", "прекратил", "преобразовал", "преодолел", "прервал", "претерпел", "прибавлял", "прибивал", "приближал", "прибыл", "привел", "привлекал", "приводил", "пригласил", "приглядел", "пригнал", "пригнул", "приготовил", "придавал", "придержал", "придумал", "приезжал", "приехал", "прижал", "призвал", "признавал", "признал", "призывал", "приказал", "прикрыл", "применил", "применял", "принадлежал", "принимал", "приносил", "принял", "приобрел", "присел", "прислал", "пристал", "приступил", "присутствовал", "приходил", "пробовал", "пробормотал", "провел", "проверил", "проверял", "проводил", "провожал", "проговорил", "продавал", "продал", "продемонстрировал", "продолжал", "продолжил", "проживал", "прожил", "прозвучал", "проиграл", "произвел", "производил", "произнес", "произносил", "происходил", "пропал", "пропустил", "просил", "прослушал", "простил", "просунул", "противоречил", "протянул", "проходил", "прочитал", "прошептал", "прощал", "проявил", "проявлял", "прыгал", "прятал", "пугал", "пускал", "пустил", "пытал", "работл", "радовал", "разбил", "разбирал", "разбудил", "развел", "развернул", "развесил", "развивал", "разглядел", "разглядывал", "разговаривал", "раздал", "раздевал", "разделил", "разделял", "разложил", "разминировал", "размышлял", "разобрал", "разработал", "разразил", "разрешил", "разрушил", "ранил", "раскачал", "раскрыл", "распахнул", "располагал", "расположил", "распространил", "распространял", "рассказал", "рассказывал", "рассматривал", "рассмотрел", "расстрелял", "рассуждал", "рассчитал", "рассчитывал", "расформировал", "расширил", "рвал", "реагировал", "реализовал", "рекомендовал", "решал", "решил", "рисковал", "рисовал", "родил", "руководил", "рухнул", "сбил", "сбросил", "свел", "свернул", "свидетельствовал", "связал", "связывал", "сдавал", "сдал", "сделал", "сдружил", "сел", "сидел", "сиял", "сказал", "складывал", "скрывал", "скрыл", "следил", "следовал", "сложил", "сломал", "служил", "слукавил", "слышал", "сменил", "смотрел", "снимал", "снял", "собирал", "собрал", "совершал", "совершил", "советовал", "совпадал", "содержал", "соединил", "создавал", "создал", "сократил", "сообразил", "сообщал", "сообщил", "соответствовал", "сопровождал", "составил", "составлял", "состоял", "сохранил", "сохранял", "спал", "спасал", "спешил", "спорил", "способствовал", "справил", "спрашивал", "спросил", "спрятал", "спускал", "спустил", "сравнил", "ставил", "стал", "стеснял", "стоил", "столкнул", "стоял", "страдал", "стрелял", "строил", "стучал", "судил", "сумел", "сунул", "существовал", "сформулировал", "схватил", "сходил", "считал", "съел", "сыграл", "танцевал", "тащил", "творил", "терпел", "терял", "ткнул", "торговал", "торопил", "торчал", "тратил", "требовал", "трогал", "тронул", "тянул", "убедил", "убежал", "убивал", "убил", "убрал", "убыл", "уважал", "увеличил", "уверял", "увидел", "угадывал", "удалил", "ударил", "уделил", "удержал", "удерживал", "удивил", "удивлял", "уехал", "узнавал", "узнал", "указал", "указывал", "украл", "умел", "умирал", "уничтожил", "упал", "упомянул", "управлял", "услышал", "уснул", "успевал", "успел", "успокоил", "устал", "устанавливал", "установил", "устраивал", "устроил", "уступал", "утвердил", "утверждал", "уточнил", "утратил", "уходил", "участвовал", "учел", "учил", "учитывал", "уяснил", "формировал", "хватал", "хватил", "ходил", "хотел", "хохотал", "хранил", "целовал", "ценил", "читал", "чувствовал", "шептал", "шутил", "явил"};
	ru_003 = {"бил", "брал", "вез", "видел", "внес", "возрос", "волновал", "вынес", "гнал", "занес", "исчез", "исчез", "лег", "лез", "мог", "нанес", "нес", "обусловил", "обязал", "окружил", "отнес", "перенес", "повез", "погиб", "полез", "понес", "постиг", "постриг", "потряс", "привез", "привлек", "привык", "принес", "произнес", "проч", "развивал", "разрушил", "рос", "связал", "связывал", "смог", "спас", "спасал", "тек", "тратил", "удивил", "умер"};
	ru_004 = {"беседовал", "беспокоил", "бил", "благодарил", "борол", "боял", "бросал", "бросил", "валял", "варил", "вводил", "вел", "велел", "вернул", "взвесил", "взял", "видел", "включал", "включил", "вложил", "возвращал", "возражал", "волновал", "воскликнул", "воспользовал", "восстановил", "вставал", "встретил", "встречал", "вступил", "выбирал", "выбрал", "выбросил", "вывел", "выдавал", "выдал", "выделил", "выделял", "выдержал", "вызвал", "выносил", "вынул", "выполнил", "выполнял", "выпускал", "выпустил", "выражал", "выразил", "вырвал", "высказал", "выставил", "выступил", "вытащил", "вытянул", "выявил", "гнул", "готовил", "грозил", "давал", "двигал", "двинул", "делал", "делил", "держал", "длил", "добавил", "добавлял", "добивал", "добил", "добрал", "доверил", "догадал", "догадывал", "договорил", "дождал", "дожидал", "дознавал", "допускал", "допустил", "дослужил", "доставал", "доставил", "достал", "жаловал", "женил", "забирал", "заблудил", "заботил", "забрал", "забывал", "завел", "завернул", "завершил", "завивал", "заглянул", "загнул", "заговорил", "задавал", "задал", "задержал", "задумал", "задумывал", "заинтересовал", "заказывал", "заканчивал", "заключал", "заключил", "закончил", "закрывал", "закрыл", "заменил", "занимал", "занял", "записал", "записывал", "заполнил", "запомнил", "заработал", "зарегистрировал", "заслужил", "засмеял", "засомневал", "застрелил", "заступил", "засыпал", "защитил", "защищал", "заявил", "заявлял", "звал", "играл", "избавил", "избрал", "извинил", "издавал", "издал", "изложил", "изменил", "изображал", "изобразил", "изучал", "изучил", "имел", "интересовал", "исключил", "исполнил", "исполнял", "использовал", "исправил", "испугал", "испытывал", "исследовал", "казал", "касал", "клал", "контролировал", "кончал", "кончил", "коснул", "крутил", "курировал", "лечил", "лишил", "ловил", "ложил", "ломал", "менял", "мешал", "мучил", "мыл", "набирал", "наблюдал", "надеял", "назвал", "называл", "налетал", "наполнил", "напоминал", "напомнил", "направил", "нарисовал", "нарушал", "нарушил", "настаивал", "научил", "находил", "начинал", "носил", "нравил", "нуждал", "обернул", "обеспечивал", "обеспечил", "обидел", "обманул", "обнаружил", "обнял", "обозначил", "обрадовал", "образовал", "образовывал", "обратил", "обращал", "обсуждал", "общал", "объединил", "объявил", "объяснил", "объяснял", "оглядывал", "оглянул", "ограничил", "одевал", "одел", "оказал", "оказывал", "окрикнул", "окружал", "окружил", "опасал", "опирал", "описал", "описывал", "опомнил", "определил", "определял", "опубликовал", "опустил", "организовал", "осветил", "освободил", "освоил", "основал", "основывал", "оставал", "оставлял", "остал", "останавливал", "остановил", "осуществил", "осуществлял", "отвел", "отвернул", "отдавал", "отказал", "отказывал", "открывал", "открыл", "отличал", "отменил", "отметил", "отмечал", "отозвал", "оторвал", "отправил", "отправлял", "отражал", "отчитал", "оформил", "охватил", "оценил", "ошиб", "ощутил", "ощущал", "перебил", "перевел", "перевернул", "переводил", "переглянул", "перегнул", "переговорил", "передавал", "перекладывал", "перекрыл", "пересмотрел", "переступил", "пересчитвал", "перетрудил", "плакал", "планировал", "повел", "поверил", "повернул", "повесил", "повторил", "повторял", "повысил", "подал", "подвел", "подготовил", "поддавал", "поддерживал", "поднимал", "поднял", "подозревал", "подписал", "подтвердил", "подтверждал", "подхватил", "подчеркивал", "познакомил", "поинтересовал", "показал", "показывал", "покачал", "покрыл", "покупал", "полагал", "положил", "получал", "пользовал", "полюбил", "помешал", "понадобил", "понравил", "попал", "попытал", "поразил", "поручил", "посвятил", "послушал", "послышал", "посоветовал", "поставил", "постарал", "посылал", "потерял", "потребовал", "потрудил", "потянул", "поцеловал", "почувствовал", "появил", "появлял", "превратил", "превращал", "предлагал", "предоставил", "предоставлял", "предполагал", "представил", "представлял", "предстоял", "предусмотрел", "прекратил", "преобразовал", "прервал", "прибавлял", "прибивал", "приближал", "привлекал", "приводил", "пригласил", "приглядел", "пригнул", "приготовил", "придавал", "придержал", "придумал", "прижал", "призвал", "признавал", "признал", "призывал", "прикрыл", "применил", "применял", "принимал", "приносил", "принял", "присел", "прислушивал", "притерпел", "приходил", "пробормотал", "проверил", "проверял", "проводил", "проговорил", "продавал", "продал", "продолжал", "продолжил", "проиграл", "произвел", "производил", "произносил", "проснул", "простил", "протянул", "проходил", "прощал", "проявил", "проявлял", "прятал", "пугал", "пускал", "пытал", "радовал", "разбежал", "разбил", "разбирал", "развел", "развернул", "развесил", "развивал", "разглядывал", "раздал", "раздевал", "разделил", "разложил", "разминировал", "разобрал", "разработал", "разразил", "разрешил", "раскачал", "раскомандовал", "раскрыл", "распахнул", "расплакал", "располагал", "расположил", "распространил", "распространял", "рассматривал", "рассмеял", "рассмотрел", "расстал", "рассформировал", "рассчитал", "рассчитывал", "расширил", "рвал", "реализовал", "рекомендовал", "решал", "решил", "родил", "рождал", "руководил", "сбил", "сбросил", "свел", "свернул", "связал", "сдавал", "сдал", "сделал", "сдружил", "сказал", "складывал", "скончал", "скрывал", "скрыл", "сложил", "сломал", "случал", "случил", "слышал", "сменил", "смеял", "смотрел", "снил", "снимал", "снял", "собирал", "собрал", "совершил", "советовал", "согласил", "соглашал", "содержал", "соединил", "создавал", "создал", "сократил", "сомневал", "сопровождал", "состоял", "сохранил", "сохранял", "спешил", "справил", "спрятал", "спускал", "спустил", "сравнил", "становил", "старал", "стеснял", "столкнул", "стремил", "строил", "стучал", "сунул", "сформулировал", "сходил", "считал", "тащил", "творил", "терял", "торговал", "торопил", "требовал", "тронул", "трудил", "тянул", "убедил", "убежал", "убивал", "убрал", "увеличил", "угадывал", "удавал", "удал", "удалил", "ударил", "удержал", "удивил", "удивлял", "удосужил", "узнавал", "указывал", "улыбал", "улыбнул", "уничтожил", "управлял", "усел", "усмехнул", "успокоил", "уставил", "устанавливал", "установил", "устраивал", "устроил", "утвердил", "утверждал", "учил", "учитывал", "формировал", "хватал", "хватил", "хранил", "целовал", "чувствовал", "чувстовал", "шептал", "явил"};
}

void CalculateRuDatabase() {
	string buff;
	vector<string> arr;

	arr = ru_002;
	for (string item : arr) {
		buff = item;
		buff.append("а");
		ru_002.push_back(buff);
		buff = item;
		buff.append("и");
		ru_002.push_back(buff);
	}

	arr = ru_003;
	for (string item : arr) {
		buff = item;
		buff.append("ла");
		ru_003.push_back(buff);
		buff = item;
		buff.append("ли");
		ru_003.push_back(buff);
	}

	arr = ru_004;
	for (string item : arr) {
		buff = item;
		buff.append("ся");
		ru_004.push_back(buff);
		buff = item;
		buff.append("ась");
		ru_004.push_back(buff);
		buff = item;
		buff.append("ись");
		ru_004.push_back(buff);
	}
}

void PrepareDatabase() {
	ReadRuDatabase();
	CalculateRuDatabase();
	//print(ru_001);
	//print(ru_002);
	//print(ru_003);
	//print(ru_004);
}

string GetNews(string lang, string text, vector<string> words) {
	int yep = 0;
	int buff;
	if (lang == "ru") {
		for (string item : ru_001) {
			buff = text.find(item);
			if (buff > 0) {
				yep = yep + 2;
			}
		}
		for (string item : ru_002) {
			buff = text.find(item);
			if (buff > 0) {
				yep = yep + 1;
			}
		}
		for (string item : ru_003) {
			buff = text.find(item);
			if (buff > 0) {
				yep = yep + 1;
			}
		}
		for (string item : ru_004) {
			buff = text.find(item);
			if (buff > 0) {
				yep = yep + 1;
			}
		}
	}
	else if (lang == "en") {

	}
	//print(yep);
	int cnum = Count(text, ".");
	//print(cnum);
	if (yep>cnum/2) {
		return "news";
	}
	else {
		return "not";
	}
}

class Docs {
	public:
		string fname;
		string content;
		string title;
		string text;
		string lang;
		string isnews;
		vector<string> words;

		void calculate() 		{
			content = ReadFile(fname);
			title = GetTitle(content);
			text = GetClearText(content);
			words = GetWords(text);
			lang = GetLanguage(words);
			isnews = GetNews(lang, text, words);
		}
	private:
		float average_ball;
};

void WorkingWithFile(string fname, int& i) {
	string content = ReadFile(fname);
	string title = GetTitle(content);
	string text = GetClearText(content);
	vector<string> words = GetWords(text);
	string lang = GetLanguage(words);
	string isnews = GetNews(lang, text, words);

	if (lang != "ru") {
		return;
	}
	string newfname = lang.append("/");
	newfname = newfname.append(isnews);
	newfname = newfname.append("/");
	newfname = newfname.append(to_string(i));
	newfname = newfname.append(".html");
	ofstream file(newfname);
	file << content << endl;
	file.close();
	i++;
}


///
/// Start of the program
///

int main()
{
	PrepareDatabase();
	int i = 0;
	//string fname = "source_dir/20191101/00/646211304670367566.html";
	//string fname = "source_dir/20191101/00/993065344121705.html";
	//string fname = "source_dir/20191101/00/7659932480825610.html";
	//WorkingWithFile(fname, i);

	vector<string> filelist = ReadDirectory("source_dir");
	//print(filelist);
	print(filelist.size());

	for (string fname : filelist)
	{
		WorkingWithFile(fname, i);
	}
	

	//Docs doc;
	//doc.fname = fname;
	//doc.calculate();
	//print(doc.isnews);



	return 0;
}
