// -*- coding: utf_8 -*-
#include <iostream>
#include <fstream>
#include <string>
#include <vector>
#include <locale>
#include <codecvt>
#include <dirent.h>
#include <time.h>
using namespace std;


vector<string> ru_001; // Наречия времени (вчера, сегодня, недавно)
vector<string> ru_002; // Глаголы прошедшего времени с окончанием а/и (сказал(а/и), сообщил(а/и))
vector<string> ru_003; // Глаголы прошедшего времени с окончанием ла/ли (постиг(ла/ли), постриг(ла/ли))
vector<string> ru_004; // Глаголы прошедшего времени с окончанием ся/ась/ись (попал(ся/ась/ись), появил(ся/ась/ись))
vector<string> ru_101; // Ассоциации к слову Общество (включает политику, выборы, законодательство, происшествия, преступления)
vector<string> ru_102; // Ассоциации к слову Экономика (включает рынки, финансы, бизнес)
vector<string> ru_103; // Ассоциации к слову Технология (включает гаджеты, авто, приложения, интернет)
vector<string> ru_104; // Ассоциации к слову Спорт
vector<string> ru_105; // Ассоциации к слову Развлечения (включает фильмы, музыка, игры, книги, искусство)
vector<string> ru_106; // Ассоциации к слову Наука (включает здоровье, биология, физика,генетика)

vector<string> en_001;
vector<string> en_002;
vector<string> en_003;
vector<string> en_004;
vector<string> en_101;
vector<string> en_102;
vector<string> en_103;
vector<string> en_104;
vector<string> en_105;
vector<string> en_106;


void print(int item) {
	cout << item << endl;
}
void print(string text) {
	cout << text << endl;
}
void print(vector<int> arr) {
	cout << "Array: (" << endl;
	for (int item : arr) {
		cout << "  " << item << endl;
	}
	cout << ")" << endl;
}
void print(vector<string> arr) {
	cout << "Array: (" << endl;
	for (string item : arr) {
		cout << "  " << item << endl;
	}
	cout << ")" << endl;
}

wstring s2ws(const string& str) {
	using convert_typeX = codecvt_utf8<wchar_t>;
	wstring_convert<convert_typeX, wchar_t> converterX;
	return converterX.from_bytes(str);
}

string ws2s(const wstring& wstr) {
	using convert_typeX = codecvt_utf8<wchar_t>;
	wstring_convert<convert_typeX, wchar_t> converterX;
	return converterX.to_bytes(wstr);
}

int Count(string text, string sub) {
	int out = 0;
	int start = 0;
	int textlen = text.length();
	while (true) {
		start = text.find(sub, start) + sub.length();
		if (start <= 0 || start > textlen) {
			break;
		}
		else {
			out++;
		}
	}
	return out;
}

vector<string> Split(string text, char delimiter = ' ') {
	int start = 0;
	int end;
	int total;
	string buff;
	vector<string> arr;

	while (true) {
		end = text.find(delimiter, start);
		if (end < 0) {
			break;
		}
		total = end-start;
		buff = text.substr(start, total);
		arr.push_back(buff);
		start = end+1;
	}
	return arr;
}

string ReadFile(string fname) {
	ifstream file;
	string buffer;

	file.open(fname);
	if (file.is_open() == false) {
		cout << "Can't open file: " << fname << endl;
	}
	string content( (istreambuf_iterator<char>(file) ),
					(istreambuf_iterator<char>()     ) );
	return content;
}

string GetTitle(string content) {
	int start;
	int end;
	int total;
	string text;

	string str = "<h1>";
	start = content.find(str) + str.length();
	end = content.find("</h1>");
	total = end-start;
	text = content.substr(start, total);
	return text;
}

string GetClearText(string content) {
	int start;
	int end;
	int total;
	string text = content;

	while (true) {
		start = text.find('<');
		end = text.find('>')+1;
		if (start < 0) {
			break;
		}
		total = end-start;
		text.erase(start, total);
	}
	return text;
}

void StringLower(wstring& str) {
	vector<wchar_t> arr_RU = {L'А', L'Б', L'В', L'Г', L'Д', L'Е', L'Ж', L'З', L'И', L'К', L'Л', L'М', L'Н', L'О', L'П', L'Р', L'С', L'Т', L'У', L'Ф', L'Х', L'Ц', L'Ч', L'Ш', L'Щ', L'Ъ', L'Ы', L'Ь', L'Э', L'Ю', L'Я'};
	vector<wchar_t> arr_ru = {L'а', L'б', L'в', L'г', L'д', L'е', L'ж', L'з', L'и', L'к', L'л', L'м', L'н', L'о', L'п', L'р', L'с', L'т', L'у', L'ф', L'х', L'ц', L'ч', L'ш', L'щ', L'ъ', L'ы', L'ь', L'э', L'ю', L'я'};
	vector<char> arr_EN = {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'};
	vector<char> arr_en = {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'};

	for (int j=0; j<str.size(); j++) {
		for (int i = 0; i < arr_RU.size(); i++) {
			if (str[j]==arr_RU[i]) {
				str[j]=arr_ru[i];
			}
			else if (str[j]==arr_EN[i]) {
				str[j]=arr_en[i];
			}
		}
	}
}

string GetClearWord(string str) {
	int start;
	vector<wchar_t> arr = {'"', ',', '.', '!', '?', ':', ';', '(', ')', L'«', L'»'};
	wstring word = s2ws(str);

	for (wchar_t item : arr) {
		while (true) {
			start = word.find(item);
			if (start < 0) {
				break;
			}
			word.erase(start, 1);
		}
	}
	StringLower(word);

	return ws2s(word);
}

vector<string> GetWords(string text) {
	vector<string> output;
	vector<string> arr = Split(text);

	for (string word : arr) {
		if (word.length() >= 3) {
			word = GetClearWord(word);
			output.push_back(word);
		}
	}
	return output;
}

string GetLanguage(string text) {
	int i = 0;
	int ru = 0;
	int en = 0;
	int other = 0;
	int textlen = text.size();
	wstring wtext = s2ws(text);

	for (wchar_t item : wtext) {
		if (ru > textlen/2 || en > textlen/2 || other > textlen/2) {
			break;
		}

		if (item >= L'А' && item <= L'Я' || item >= L'а' && item <= L'я') {
			ru++;
		}
		else if (item >= 'A' && item <= 'Z' || item >= 'a' && item <= 'z') {
			en++;
		}
		else {
			other++;
		}
	}
	if (ru > en && ru > other) {
		return "ru";
	}
	if (en > ru && en > other) {
		return "en";
	}
	if (other > ru && other > en) {
		return "--";
	}
}

string as(string dirname) {
	int a = dirname.size()-1;
	char s = dirname[a];
	if (s != '/') {
		dirname.append("/");
	}
	return dirname;
}

vector<string> OpenDirectory(string dirname, string mod) {
	vector<string> output;

	const char *c_dirname = dirname.c_str();
	DIR *dir = opendir(c_dirname);
	if (dir) {
		struct dirent *ent;
		while ((ent = readdir(dir)) != NULL) {
			dirname = ent->d_name;
			if (dirname != "." && dirname != "..") {
				int a = dirname.find(".");
				if (a < 0 && mod == "dirs") {
					output.push_back(dirname);
				}
				else if (a > 0 && mod == "files") {
					output.push_back(dirname);
				}
			}
		}
		closedir(dir);
	}
	else {
		string error_msg = "Error opening directory: ";
		print(error_msg.append(dirname));
	}
	return output;
}

vector<string> ReadDirectory(string dirname) {
	vector<string> buff;
	vector<string> buff2;
	vector<string> output;

	buff = OpenDirectory(dirname, "files");
	for (string item : buff) {
		output.push_back(as(dirname).append(item));
	}

	buff = OpenDirectory(dirname, "dirs");
	for (string item : buff) {
		string dirname2 = as(dirname);
		dirname2 = dirname2.append(item);
		buff2 = ReadDirectory(dirname2);
		for (string item2 : buff2) {
			output.push_back(item2);
		}
	}
	return output;
}

void ReadRuDatabase() {
	ru_001 = {"недавно", "вчера", "сегодня", "сейчас", "накануне", "раньше", "позже", "теперь", "сегодняшнего", "на этой неделе", "на прошлой недедле", "в эту неделю", "в этот месяц", "в этом месяце", "в этом году",  "в понедельник", "во вторник", "в cреду", "в четверг", "в пятницу", "в субботу", "в воскресенье"};
	ru_002 = {"арестовал", "бегал", "бежал", "беседовал", "беспокоил", "бил", "благодарил", "блестел", "болел", "бормотал", "брал", "бродил", "бросал", "бросил", "бывал", "был", "валял", "варил", "ввел", "вводил", "вел", "велел", "верил", "вернул", "взвесил", "взглянул", "вздохнул", "взял", "видал", "видел", "висел", "включал", "включил", "владел", "влиял", "вложил", "вносил", "водил", "воевал", "возвращал", "возглавлял", "возникал", "возникнул", "возражал", "возразил", "волновал", "воскликнул", "воспринял", "восстановил", "врал", "вскочил", "вскрыл", "вспоминал", "вспомнил", "вставал", "встал", "встретил", "встречал", "вступал", "вступил", "входил", "выбирал", "выбрал", "выбросил", "вывел", "выглядел", "выдавал", "выдал", "выделил", "выделял", "выдержал", "выжил", "вызвал", "вызывал", "выиграл", "выносил", "вынудил", "вынул", "выпал", "выпил", "выполнил", "выполнял", "выпрыгнул", "выпускал", "выпустил", "выражал", "выразил", "вырастил", "вырвал", "вырезал", "высказал", "выскочил", "выслушал", "выставил", "выступал", "выступил", "вытащил", "вытянул", "выявил", "выяснил", "гарантировал", "гибнул", "глядел", "глянул", "гнал", "гнул", "говорил", "горел", "готовил", "грозил", "гулял", "давал", "дал", "дарил", "двигал", "двинул", "действовал", "делал", "делил", "демонстрировал", "держал", "добавил", "добавлял", "добивал", "добил", "добрал", "довел", "доверял", "договорил", "доказал", "доказывал", "доложил", "допускал", "допустил", "дослужил", "доставал", "доставил", "достал", "достигал", "достигнул", "доходил", "дрожал", "дружил", "думал", "дышал", "ездил", "ехал", "жалел", "жаловал", "ждал", "желал", "женил", "жил", "забирал", "заболел", "заботил", "забрал", "забывал", "забыл", "завел", "завернул", "завершил", "завивал", "зависел", "заглядывал", "заглянул", "загнул", "заговорил", "задавал", "задал", "задержал", "задумал", "задумывал", "заинтересовал", "заказал", "заказывал", "заканчивал", "заключал", "заключил", "закончил", "закричал", "закрывал", "закрыл", "закурил", "заложил", "заменил", "замерил", "заметил", "замечал", "замолчал", "занимал", "занял", "записал", "записывал", "заплакал", "заплатил", "заполнил", "запомнил", "запретил", "запрыгнул", "зарабатывал", "заработал", "зарегистрировал", "заслужил", "засмеял", "заснул", "заставил", "заставлял", "застрелил", "заступил", "засыпал", "захватил", "заходил", "захотел", "зачитал", "защитил", "защищал", "заявил", "заявлял", "звал", "звонил", "звучал", "здравствовал", "знал", "значил", "играл", "избавил", "избежал", "избрал", "извинил", "издавал", "издал", "изложил", "изменил", "изображал", "изобразил", "изучал", "изучил", "имел", "интересовал", "искал", "исключил", "исполнил", "исполнял", "использовал", "исправил", "испугал", "испытал", "испытывал", "исследовал", "исходил", "исчез", "исчезал", "кивал", "кивнул", "кинул", "клал", "командовал", "контролировал", "кончал", "кончил", "кормил", "крикнул", "кричал", "крутил", "купил", "курил", "курировал", "лежал", "летал", "летел", "лечил", "лишил", "ловил", "ломал", "любил", "махнул", "менял", "мечтал", "мешал", "минировал", "миновал", "молил", "молчал", "мучил", "мыл", "набирал", "наблюдал", "набрал", "надел", "надоел", "назвал", "назначил", "называл", "налетал", "налил", "напечатал", "написал", "наполнил", "напоминал", "напомнил", "направил", "нарисовал", "нарушал", "нарушил", "настаивал", "наступал", "наступил", "научил", "находил", "начал", "начинал", "ненавидел", "носил", "обернул", "обеспечивал", "обеспечил", "обещал", "обидел", "обладал", "обманул", "обнаружил", "обнял", "обобрал", "обозначил", "обрадовал", "образовал", "образовывал", "обратил", "обращал", "обрел", "обсмеял", "обсудил", "обсуждал", "обусловил", "объединил", "объявил", "объяснил", "объяснял", "обязал", "оглянул", "ограничил", "одевал", "одел", "ожидал", "означал", "оказал", "оказывал", "окончил", "окрикнул", "окружал", "окружил", "опередил", "описал", "описывал", "определил", "определял", "опубликовал", "опустил", "орал", "организовал", "осветил", "освободил", "освоил", "основал", "основывал", "оставил", "оставлял", "останавливал", "остановил", "осуществил", "осуществлял", "отвел", "отвернул", "ответил", "отвечал", "отдавал", "отдал", "отдохнул", "отдыхал", "отказал", "отказывал", "открывал", "открыл", "отличал", "отложил", "отменил", "отметил", "отмечал", "относил", "отобрал", "отозвал", "оторвал", "отправил", "отправлял", "отпустил", "отражал", "отрезал", "отсутствовал", "отчитал", "оформил", "охватил", "оценивал", "оценил", "ощутил", "ощущал", "падал", "пахнул", "пел", "перебил", "перевел", "перевернул", "переводил", "перегнул", "переговорил", "передавал", "передал", "переехал", "переживал", "пережил", "переиграл", "перекладывал", "перекрыл", "перелетел", "переложил", "перепечатал", "перепрыгнул", "перерабатывал", "перерешал", "пересмотрел", "переставал", "перестал", "переступил", "пересчитал", "перетанцевал", "переходил", "перечеркнул", "перечитал", "пил", "писал", "плавал", "плакал", "планировал", "платил", "плыл", "побегал", "победил", "побежал", "побрил", "побывал", "повел", "поверил", "повернул", "повесил", "повторил", "повторял", "повысил", "погадал", "поглядел", "поглядывал", "поговорил", "погулял", "подавал", "подал", "подарил", "подвел", "подготовил", "поддавал", "поддержал", "поддерживал", "поделил", "подлежал", "поднимал", "поднял", "подобрал", "подождал", "подозревал", "подписал", "подтвердил", "подтверждал", "подумал", "подхватил", "подходил", "подчеркивал", "подчеркнул", "поехал", "пожалел", "пожелал", "позвал", "позволил", "позволял", "позвонил", "поздравил", "поздравлял", "познавал", "познакомил", "поймал", "показал", "показывал", "покачал", "покинул", "покрыл", "покупал", "полагал", "полетел", "положил", "получал", "получил", "полюбил", "помешал", "помнил", "помог", "помогал", "помолчал", "понимал", "понял", "пообещал", "попадал", "попал", "попробовал", "попросил", "попытал", "поразил", "порешал", "поручил", "посадил", "посвятил", "посетил", "посещал", "посидел", "послал", "последовал", "послушал", "посмотрел", "посоветовал", "поставил", "постоял", "пострадал", "построил", "поступал", "поступил", "посылал", "потанцевал", "потерял", "потратил", "потребовал", "потянул", "походил", "похорошел", "поцеловал", "почитал", "почувствовал", "пошл", "пояснил", "превратил", "превращал", "превышал", "предвидел", "предлагал", "предложил", "предназначил", "предоставил", "предоставлял", "предотвратил", "предполагал", "предположил", "предпочитал", "представил", "представлял", "предстоял", "предупредил", "предупреждал", "предусматривал", "предусмотрел", "предъявил", "прекратил", "преобразовал", "преодолел", "прервал", "претерпел", "прибавлял", "прибивал", "приближал", "прибыл", "привел", "привлекал", "приводил", "пригласил", "приглядел", "пригнал", "пригнул", "приготовил", "придавал", "придержал", "придумал", "приезжал", "приехал", "прижал", "призвал", "признавал", "признал", "призывал", "приказал", "прикрыл", "применил", "применял", "принадлежал", "принимал", "приносил", "принял", "приобрел", "присел", "прислал", "пристал", "приступил", "присутствовал", "приходил", "пробовал", "пробормотал", "провел", "проверил", "проверял", "проводил", "провожал", "проговорил", "продавал", "продал", "продемонстрировал", "продолжал", "продолжил", "проживал", "прожил", "прозвучал", "проиграл", "произвел", "производил", "произнес", "произносил", "происходил", "пропал", "пропустил", "просил", "прослушал", "простил", "просунул", "противоречил", "протянул", "проходил", "прочитал", "прошептал", "прощал", "проявил", "проявлял", "прыгал", "прятал", "пугал", "пускал", "пустил", "пытал", "работл", "радовал", "разбил", "разбирал", "разбудил", "развел", "развернул", "развесил", "развивал", "разглядел", "разглядывал", "разговаривал", "раздал", "раздевал", "разделил", "разделял", "разложил", "разминировал", "размышлял", "разобрал", "разработал", "разразил", "разрешил", "разрушил", "ранил", "раскачал", "раскрыл", "распахнул", "располагал", "расположил", "распространил", "распространял", "рассказал", "рассказывал", "рассматривал", "рассмотрел", "расстрелял", "рассуждал", "рассчитал", "рассчитывал", "расформировал", "расширил", "рвал", "реагировал", "реализовал", "рекомендовал", "решал", "решил", "рисковал", "рисовал", "родил", "руководил", "рухнул", "сбил", "сбросил", "свел", "свернул", "свидетельствовал", "связал", "связывал", "сдавал", "сдал", "сделал", "сдружил", "сел", "сидел", "сиял", "сказал", "складывал", "скрывал", "скрыл", "следил", "следовал", "сложил", "сломал", "служил", "слукавил", "слышал", "сменил", "смотрел", "снимал", "снял", "собирал", "собрал", "совершал", "совершил", "советовал", "совпадал", "содержал", "соединил", "создавал", "создал", "сократил", "сообразил", "сообщал", "сообщил", "соответствовал", "сопровождал", "составил", "составлял", "состоял", "сохранил", "сохранял", "спал", "спасал", "спешил", "спорил", "способствовал", "справил", "спрашивал", "спросил", "спрятал", "спускал", "спустил", "сравнил", "ставил", "стал", "стеснял", "стоил", "столкнул", "стоял", "страдал", "стрелял", "строил", "стучал", "судил", "сумел", "сунул", "существовал", "сформулировал", "схватил", "сходил", "считал", "съел", "сыграл", "танцевал", "тащил", "творил", "терпел", "терял", "ткнул", "торговал", "торопил", "торчал", "тратил", "требовал", "трогал", "тронул", "тянул", "убедил", "убежал", "убивал", "убил", "убрал", "убыл", "уважал", "увеличил", "уверял", "увидел", "угадывал", "удалил", "ударил", "уделил", "удержал", "удерживал", "удивил", "удивлял", "уехал", "узнавал", "узнал", "указал", "указывал", "украл", "умел", "умирал", "уничтожил", "упал", "упомянул", "управлял", "услышал", "уснул", "успевал", "успел", "успокоил", "устал", "устанавливал", "установил", "устраивал", "устроил", "уступал", "утвердил", "утверждал", "уточнил", "утратил", "уходил", "участвовал", "учел", "учил", "учитывал", "уяснил", "формировал", "хватал", "хватил", "ходил", "хотел", "хохотал", "хранил", "целовал", "ценил", "читал", "чувствовал", "шептал", "шутил", "явил"};
	ru_003 = {"бил", "брал", "вез", "видел", "внес", "возрос", "волновал", "вынес", "гнал", "занес", "исчез", "исчез", "лег", "лез", "мог", "нанес", "нес", "обусловил", "обязал", "окружил", "отнес", "перенес", "повез", "погиб", "полез", "понес", "постиг", "постриг", "потряс", "привез", "привлек", "привык", "принес", "произнес", "проч", "развивал", "разрушил", "рос", "связал", "связывал", "смог", "спас", "спасал", "тек", "тратил", "удивил", "умер"};
	ru_004 = {"беседовал", "беспокоил", "бил", "благодарил", "борол", "боял", "бросал", "бросил", "валял", "варил", "вводил", "вел", "велел", "вернул", "взвесил", "взял", "видел", "включал", "включил", "вложил", "возвращал", "возражал", "волновал", "воскликнул", "воспользовал", "восстановил", "вставал", "встретил", "встречал", "вступил", "выбирал", "выбрал", "выбросил", "вывел", "выдавал", "выдал", "выделил", "выделял", "выдержал", "вызвал", "выносил", "вынул", "выполнил", "выполнял", "выпускал", "выпустил", "выражал", "выразил", "вырвал", "высказал", "выставил", "выступил", "вытащил", "вытянул", "выявил", "гнул", "готовил", "грозил", "давал", "двигал", "двинул", "делал", "делил", "держал", "длил", "добавил", "добавлял", "добивал", "добил", "добрал", "доверил", "догадал", "догадывал", "договорил", "дождал", "дожидал", "дознавал", "допускал", "допустил", "дослужил", "доставал", "доставил", "достал", "жаловал", "женил", "забирал", "заблудил", "заботил", "забрал", "забывал", "завел", "завернул", "завершил", "завивал", "заглянул", "загнул", "заговорил", "задавал", "задал", "задержал", "задумал", "задумывал", "заинтересовал", "заказывал", "заканчивал", "заключал", "заключил", "закончил", "закрывал", "закрыл", "заменил", "занимал", "занял", "записал", "записывал", "заполнил", "запомнил", "заработал", "зарегистрировал", "заслужил", "засмеял", "засомневал", "застрелил", "заступил", "засыпал", "защитил", "защищал", "заявил", "заявлял", "звал", "играл", "избавил", "избрал", "извинил", "издавал", "издал", "изложил", "изменил", "изображал", "изобразил", "изучал", "изучил", "имел", "интересовал", "исключил", "исполнил", "исполнял", "использовал", "исправил", "испугал", "испытывал", "исследовал", "казал", "касал", "клал", "контролировал", "кончал", "кончил", "коснул", "крутил", "курировал", "лечил", "лишил", "ловил", "ложил", "ломал", "менял", "мешал", "мучил", "мыл", "набирал", "наблюдал", "надеял", "назвал", "называл", "налетал", "наполнил", "напоминал", "напомнил", "направил", "нарисовал", "нарушал", "нарушил", "настаивал", "научил", "находил", "начинал", "носил", "нравил", "нуждал", "обернул", "обеспечивал", "обеспечил", "обидел", "обманул", "обнаружил", "обнял", "обозначил", "обрадовал", "образовал", "образовывал", "обратил", "обращал", "обсуждал", "общал", "объединил", "объявил", "объяснил", "объяснял", "оглядывал", "оглянул", "ограничил", "одевал", "одел", "оказал", "оказывал", "окрикнул", "окружал", "окружил", "опасал", "опирал", "описал", "описывал", "опомнил", "определил", "определял", "опубликовал", "опустил", "организовал", "осветил", "освободил", "освоил", "основал", "основывал", "оставал", "оставлял", "остал", "останавливал", "остановил", "осуществил", "осуществлял", "отвел", "отвернул", "отдавал", "отказал", "отказывал", "открывал", "открыл", "отличал", "отменил", "отметил", "отмечал", "отозвал", "оторвал", "отправил", "отправлял", "отражал", "отчитал", "оформил", "охватил", "оценил", "ошиб", "ощутил", "ощущал", "перебил", "перевел", "перевернул", "переводил", "переглянул", "перегнул", "переговорил", "передавал", "перекладывал", "перекрыл", "пересмотрел", "переступил", "пересчитвал", "перетрудил", "плакал", "планировал", "повел", "поверил", "повернул", "повесил", "повторил", "повторял", "повысил", "подал", "подвел", "подготовил", "поддавал", "поддерживал", "поднимал", "поднял", "подозревал", "подписал", "подтвердил", "подтверждал", "подхватил", "подчеркивал", "познакомил", "поинтересовал", "показал", "показывал", "покачал", "покрыл", "покупал", "полагал", "положил", "получал", "пользовал", "полюбил", "помешал", "понадобил", "понравил", "попал", "попытал", "поразил", "поручил", "посвятил", "послушал", "послышал", "посоветовал", "поставил", "постарал", "посылал", "потерял", "потребовал", "потрудил", "потянул", "поцеловал", "почувствовал", "появил", "появлял", "превратил", "превращал", "предлагал", "предоставил", "предоставлял", "предполагал", "представил", "представлял", "предстоял", "предусмотрел", "прекратил", "преобразовал", "прервал", "прибавлял", "прибивал", "приближал", "привлекал", "приводил", "пригласил", "приглядел", "пригнул", "приготовил", "придавал", "придержал", "придумал", "прижал", "призвал", "признавал", "признал", "призывал", "прикрыл", "применил", "применял", "принимал", "приносил", "принял", "присел", "прислушивал", "притерпел", "приходил", "пробормотал", "проверил", "проверял", "проводил", "проговорил", "продавал", "продал", "продолжал", "продолжил", "проиграл", "произвел", "производил", "произносил", "проснул", "простил", "протянул", "проходил", "прощал", "проявил", "проявлял", "прятал", "пугал", "пускал", "пытал", "радовал", "разбежал", "разбил", "разбирал", "развел", "развернул", "развесил", "развивал", "разглядывал", "раздал", "раздевал", "разделил", "разложил", "разминировал", "разобрал", "разработал", "разразил", "разрешил", "раскачал", "раскомандовал", "раскрыл", "распахнул", "расплакал", "располагал", "расположил", "распространил", "распространял", "рассматривал", "рассмеял", "рассмотрел", "расстал", "рассформировал", "рассчитал", "рассчитывал", "расширил", "рвал", "реализовал", "рекомендовал", "решал", "решил", "родил", "рождал", "руководил", "сбил", "сбросил", "свел", "свернул", "связал", "сдавал", "сдал", "сделал", "сдружил", "сказал", "складывал", "скончал", "скрывал", "скрыл", "сложил", "сломал", "случал", "случил", "слышал", "сменил", "смеял", "смотрел", "снил", "снимал", "снял", "собирал", "собрал", "совершил", "советовал", "согласил", "соглашал", "содержал", "соединил", "создавал", "создал", "сократил", "сомневал", "сопровождал", "состоял", "сохранил", "сохранял", "спешил", "справил", "спрятал", "спускал", "спустил", "сравнил", "становил", "старал", "стеснял", "столкнул", "стремил", "строил", "стучал", "сунул", "сформулировал", "сходил", "считал", "тащил", "творил", "терял", "торговал", "торопил", "требовал", "тронул", "трудил", "тянул", "убедил", "убежал", "убивал", "убрал", "увеличил", "угадывал", "удавал", "удал", "удалил", "ударил", "удержал", "удивил", "удивлял", "удосужил", "узнавал", "указывал", "улыбал", "улыбнул", "уничтожил", "управлял", "усел", "усмехнул", "успокоил", "уставил", "устанавливал", "установил", "устраивал", "устроил", "утвердил", "утверждал", "учил", "учитывал", "формировал", "хватал", "хватил", "хранил", "целовал", "чувствовал", "чувстовал", "шептал", "явил"};
    ru_101 = {"авария", "авторитарный", "агитация", "адвокат", "алиби", "амнистия", "анархия", "арест", "арестант", "афера", "аффект", "банда", "бандит", "банк", "беда", "бедствие", "беззаконие", "безнаказанность", "беспредел", "больница", "большинство", "браконьер", "бутафория", "бюллетень", "бюрократия", "вердикт", "взятка", "вина", "виновник", "виновница", "виселица", "власть", "вместе", "внешняя", "внутренняя", "война", "вор", "воровство", "выбирать", "выборка", "выборы", "выдвиженец", "высшее", "гаи", "генсек", "герб", "глава", "гласность", "голос", "голосование", "голосовать", "горе", "город", "государство", "грабеж", "грабитель", "граждане", "гражданин", "грех", "группа", "грусть", "губернатор", "дебаты", "декларация", "делегация", "дело", "демократия", "деньги", "департамент", "депутат", "депутаты", "держава", "детектив", "дети", "деяние", "диктатура", "дипломат", "дипломатия", "договор", "доказательство", "доктрина", "документ", "допрос", "дорога", "дорожное", "драка", "дружба", "друзья", "дтп", "дума", "женщина", "жертва", "жизнь", "жребий", "задержание", "заключеннный", "заключённый", "закон", "законник", "законно", "законность", "законный", "законодатель", "законодательствостатья", "закономерность", "законопроект", "законы", "заложник", "запрет", "заседание", "защита", "заявление", "землетрясение", "земля", "злоумышленник", "знание", "зона", "идеология", "избиратель", "избранность", "известие", "изнасилование", "инаугурация", "индивид", "инквизиция", "интересы", "инцидент", "история", "итог", "казнь", "камера", "кандалы", "кандидат", "кандидатура", "канцлер", "капитализм", "кара", "каратель", "катаклизм", "катастрофа", "класс", "книга", "кодекс", "коллеги", "коллектив", "колония", "команда", "комитет", "коммуна", "коммуникация", "коммунист", "компания", "компартия", "конституция", "консул", "контрабанда", "коррупция", "кража", "крики", "криминал", "кровь", "круг", "кружок", "крушение", "культура", "кювет", "лидер", "листовка", "личность", "лозунг", "любовь", "люди", "мандат", "манифест", "маньяк", "марксизм", "масса", "мафия", "махинация", "машина", "меньшинство", "место", "милиционер", "милиция", "министерство", "министр", "мир", "мистерия", "митинг", "мнение", "много", "монархия", "мораль", "мораторий", "мотив", "мошенник", "мошенничество", "мужчина", "мэр", "мэрия", "наблюдатель", "наводка", "наводненние", "наезд", "наказание", "налоги", "нападение", "народ", "наручник", "наручники", "нарушать", "нарушение", "нарушитель", "нарушить", "население", "насилие", "нато", "наука", "националист", "нация", "недоразумение", "незаконно", "неожиданность", "неприятность", "несоблюдение", "несчастье", "норма", "обвинение", "обвинитель", "обвиняемый", "обстоятельство", "общаться", "общее", "общение", "общественность", "общественный", "общество", "обществоведение", "обществознание", "общий", "община", "общность", "объединение", "обыск", "ограбление", "ограждение", "ограничение", "окружение", "оон", "опасность", "оперативник", "ополченец", "оппозиция", "организация", "оружие", "осужденный", "осуждённый", "отбор", "ответственность", "отношения", "отпечатки", "очевидец", "очевидцы", "пакт", "палата", "палач", "пальцев", "паника", "парламент", "партбилет", "партиец", "партийный", "партия", "переговоры", "перестройка", "пистолет", "плохо", "плохое", "плохой", "побои", "поведение", "подделка", "подзащитный", "подозреваемый", "подозрение", "подробность", "подследственный", "подстава", "подсудимый", "подчинение", "пожар", "позиция", "показание", "показания", "покушение", "политбюро", "политик", "политика", "политики", "политический", "политолог", "политология", "полицейский", "полиция", "полномочие", "полномочия", "понятой", "поправка", "порядок", "последствие", "послушание", "посол", "посольство", "постановление", "пострадавший", "поступок", "потоп", "потребление", "похититель", "похищение", "похо", "права", "правда", "правила", "правило", "правитель", "правительство", "правление", "право", "правосудие", "предмет", "председатель", "президент", "президентство", "президиум", "премьер", "преступление", "преступник", "преступница", "преступность", "претендент", "прецентдент", "приговор", "приказ", "приключение", "приключения", "принимать", "принятие", "принять", "присвоение", "пристав", "присяжный", "причастность", "произошло", "прокуратура", "прокурор", "пропаганда", "проступок", "протест", "протокол", "прошествие", "работа", "рада", "разборки", "разговор", "разоблачение", "разьой", "раскрытие", "распоряжение", "расправа", "расследование", "расстрел", "ребёнок", "революция", "резиденция", "рейтинг", "репортаж", "репрессия", "республика", "рефередум", "реформа", "реформатор", "рецидив", "розыск", "роман", "саммит", "санкции", "сбор", "свершение", "свет", "свидетели", "свидетель", "свидетельница", "свобода", "свод", "сговор", "семья", "сенат", "сенатор", "сенсация", "ситуация", "след", "следить", "следователь", "следствие", "сливки", "слово", "случай", "случилось", "смерть", "соблюдать", "соблюдение", "собрание", "событие", "события", "совершение", "совет", "советник", "сообщество", "сообщник", "соучастник", "социализм", "социалист", "социальное", "социальный", "социология", "социум", "срок", "статья", "стечение", "страна", "страны", "строй", "суверенитет", "суд", "судить", "судья", "съезд", "сыщик", "театр", "теракт", "товарищество", "толпа", "топор", "трагедия", "транспорт", "требование", "тревога", "турьма", "тюрьма", "убивать", "убийство", "убийца", "уголовник", "уголовное", "уголовный", "угон", "ужас", "указ", "улика", "улица", "умысел", "управление", "ураган", "урна", "урок", "условие", "устав", "утверждение", "участие", "участковый", "участник", "участок", "учёба", "ущерб", "фальсификация", "федерализм", "федерация", "физика", "фирма", "фракция", "хищение", "хроника", "хулиганство", "цивилизация", "человек", "человечество", "черта", "чиновник", "член", "чрезвычайное", "шантаж", "шантрапа", "шествие", "школа", "шок", "штаб", "штраф", "элита", "эпизод", "эпопея", "юриспруденция", "юрист", "юстиция", "явление", "ячейка"};
	ru_102 = {"аванс", "акции", "арбуз", "аренда", "аудит", "бабки", "бабло", "бабушки", "базар", "баланс", "банк", "банки", "банкир", "банкомат", "банкрот", "бизнес", "бизнесвумен", "бизнесмен", "биржа", "богатство", "богатый", "босс", "бумаги", "бухгалтер", "бухгалтерия", "бюджет", "валюта", "ввп", "весы", "вещи", "вклад", "власть", "вложение", "время", "встреча", "вуз", "галстук", "город", "государство", "график", "груши", "грязь", "дебет", "дело", "деньги", "депозит", "дефолт", "дешевизна", "дёшево", "директор", "дисциплина", "договор", "документы", "долг", "доллар", "дом", "доход", "дыня", "евро", "еда", "женщина", "жизнь", "завод", "занятие", "занять", "заработок", "зарплата", "затраты", "здание", "зелень", "золото", "игра", "идея", "импорт", "инвестиции", "институт", "инфляция", "ипотека", "кабинет", "казна", "капитал", "капуста", "карта", "картошка", "карьера", "квартира", "класс", "клиент", "коллеги", "коммерция", "компания", "компьютер", "конкуренция", "копейка", "корпорация", "костюм", "кошелек", "кошелёк", "кредит", "кризис", "крики", "купец", "купить", "купля", "купюра", "курица", "курс", "лавка", "ланч", "ларёк", "леди", "лоток", "люди", "магазин", "макроэкономика", "мало", "малый", "маркет", "маркетинг", "математика", "машина", "мелочь", "мен", "менеджер", "микроэкономика", "миллионер", "министерство", "министр", "мир", "много", "молоко", "монеты", "мужчина", "мясо", "найти", "накопление", "наличка", "налог", "налоги", "народ", "наука", "начальник", "недвижимость", "нефть", "обман", "обмен", "обувь", "общество", "обществознание", "овощ", "овощи", "огурцы", "одежда", "олигарх", "опт", "организация", "отношения", "отчёт", "офис", "очередь", "пакет", "палатка", "партнёр", "пенсия", "переговоры", "план", "покупатель", "покупать", "покупка", "политика", "помидоры", "поют", "правительство", "предложение", "предмет", "предприниматель", "предпринимательство", "предприятие", "прибыль", "привоз", "приезидент", "прилавок", "продавать", "продавец", "продавщица", "продажа", "продуктовый", "продукты", "продукция", "проект", "производство", "профессия", "проценты", "работа", "работать", "работник", "развитие", "распродажа", "расход", "расходы", "расчёт", "ресурсы", "риск", "романсы", "рост", "рубль", "рыба", "рынок", "ряды", "сбережения", "сбыт", "свой", "сдача", "сделка", "секретарь", "семечки", "семья", "скидки", "слава", "состояние", "сотрудники", "спад", "спрос", "средства", "стартап", "стоимость", "стол", "страна", "сумка", "сумма", "сфера", "счет", "счёт", "считать", "товар", "толкучка", "толпа", "торг", "торгаш", "торги", "торговать", "торговаться", "торговец", "торговля", "трата", "траты", "тренинг", "труд", "труда", "убыток", "университет", "управление", "урок", "услуги", "успех", "учёба", "учебник", "учёт", "финансирование", "финансист", "финансовый", "финансы", "фирма", "фонд", "фрукты", "хачи", "хозяйство", "цена", "центр", "цифры", "цыгане", "человек", "чурка", "шеф", "школа", "шум", "эконом", "экономика", "экономист", "экономить", "экономический", "экономичный", "экономия", "экономная", "экономный", "экспорт", "яблоки", "ягоды", "ярмарка"};
	ru_103 = {"абонент", "авария", "автобаза", "автобан", "автобус", "автограф", "автозапчасти", "автомагистраль", "автомат", "автоматчик", "автомашина", "автомобили", "автомобилист", "автомобиль", "автопилот", "авторитарный", "авторитет", "авторучка", "автослесарь", "азс", "айпи", "айфон", "аккумулятор", "аксессуар", "алгоритм", "амортизатор", "андроид", "антенна", "аппарат", "ауди", "багажник", "бензин", "бесплатное", "беспроводной", "биография", "блог", "бмв", "болтать", "болты", "бонус", "бордюр", "браузер", "будущее", "быстрый", "вай-фай", "веб", "век", "велосипед", "версия", "видео", "винил", "вираж", "вирус", "вкипедия", "вконтакте", "владелец", "вложение", "водитель", "водить", "вождение", "время", "всемирная", "всемирный", "выбор", "выезд", "выполнение", "гаджет", "гаджеты", "газ", "газель", "гаи", "гараж", "глобализация", "глушитель", "глюк", "гонка", "гонки", "гонщик", "грузовик", "группа", "гугл", "датчик", "дверь", "двигатель", "движение", "действий", "делать", "дело", "детали", "деталь", "диагностика", "доклад", "домен", "дополнение", "дорога", "дорогое", "доступ", "доступность", "досуг", "друзья", "езда", "ездить", "ехать", "жигули", "жизнь", "зависимость", "завод", "заправка", "запрос", "запуск", "запчасть", "заряжать", "знакомство", "знания", "знать", "игра", "игры", "идеализация", "изготовление", "изобретение", "изучать", "инаугурация", "инет", "инженер", "инновация", "иномарка", "инспектор", "инстаграм", "инструкция", "интерес", "интернет", "информатика", "информация", "искать", "искусство", "источник", "кабель", "камаз", "капот", "картинка", "картинки", "картон", "качать", "качество", "клавиатура", "кнопка", "колеса", "колесо", "колонна", "коммуникация", "комп", "компьютер", "компьютеризация", "контакт", "контент", "контроль", "коробка", "кортеж", "кузов", "кювет", "лада", "лазер", "лайк", "лимит", "лимузин", "логика", "любитель", "люди", "магазин", "магистраль", "магия", "маил", "малолитражка", "марка", "мастер", "мастерство", "машина", "машинка", "машины", "мемы", "мерин", "мерседес", "мерседес-бенц", "метод", "методика", "методология", "метро", "механизм", "мир", "мобильник", "мобильный", "мода", "модем", "мойка", "монитор", "мотор", "мотоцикл", "музыка", "мышка", "мышь", "навигатор", "навигация", "нано", "нанотехнология", "настройка", "наука", "наушники", "неполадки", "новая", "новинка", "новое", "новшество", "ноу-хау", "ноутбук", "обновление", "оборудование", "обработка", "обшивка", "общение", "объявление", "одноклассники", "онлайн", "опера", "ответы", "отрасль", "парковка", "пароль", "пассажир", "пассажиры", "паутина", "пдд", "педаль", "переводчик", "передатчик", "передача", "передвижение", "план", "планшет", "плеер", "подвеска", "подключение", "поиск", "поисковик", "покупка", "полиглот", "полировка", "пользование", "пользователь", "помощь", "портал", "порядок", "последовательность", "почта", "права", "правило", "предмет", "прибор", "приготовления", "приезд", "приложение", "принтер", "приставка", "провайдер", "провод", "провода", "программа", "программист", "прогресс", "продажи", "продукт", "продукция", "производство", "прокат", "промышленность", "прорыв", "прототип", "профессия", "профиль", "процесс", "процессор", "публикация", "работа", "радиатор", "радиоперехват", "разборка", "развал", "развитие", "разработка", "разъезд", "распространение", "резина", "ресурсы", "робот", "ролик", "роутер", "рукоделие", "руль", "рычаг", "сайт", "салон", "сальник", "самоучитель", "связист", "связь", "селфи", "сервер", "сервис", "сериалы", "сёрфинг", "сетка", "сеть", "сигнализация", "сидение", "симка", "синхронизация", "сисадмин", "система", "скачать", "скорость", "скупщик", "слесарь", "сложная", "слушать", "смайл", "смайлик", "смартфон", "смс", "собеседник", "современная", "современность", "соединение", "сообщение", "сообщения", "сотовый", "соцсети", "спам", "спецагент", "способ", "ссылка", "стабилизация", "статус", "стоп", "стоянка", "страница", "страницы", "страхование", "строитель", "схема", "сцепление", "такси", "таксист", "тактик", "тариф", "тарификация", "тачка", "твитер", "твиттер", "телевизор", "телеграмм", "телефон", "техник", "техника", "техникум", "технический", "техно", "технолог", "технологии", "технологический", "технологичный", "технология", "тормоз", "торрент", "трамвай", "транспорт", "трасса", "трафик", "труд", "умение", "урок", "установка", "устройство", "учеба", "учёба", "учёные", "учёный", "учитель", "фабрика", "файл", "фара", "фары", "фейсбук", "физика", "фильмы", "флешка", "фокстрот", "форт", "форум", "фото", "фургон", "хакер", "химия", "хост", "хостинг", "цивилизация", "часы", "чат", "человек", "шестёрка", "шестерня", "шина", "шины", "шить", "шитьё", "школа", "шофёр", "экран", "электричество", "электроника", "яндекс", "япония"};
	ru_104 = {"абонемент", "активный", "альпинизм", "арбалет", "атлет", "атлетика", "аэробика", "баскетбол", "бассейн", "бег", "бега", "бегать", "беготня", "бежать", "бейсбол", "биатлон", "бокс", "боксер", "боксеры", "болельщик", "болельщики", "борец", "борьба", "бросок", "брусья", "бутсы", "велосипед", "велосипедист", "велоспорт", "волейбол", "волейболист", "ворота", "время", "выносливость", "выпад", "гандбол", "гантели", "гибкость", "гимнаст", "гимнастика", "гирька", "гиря", "гол", "гольф", "гонки", "дайвинг", "движение", "движения", "диета", "дистанция", "допинг", "достижения", "забег", "зал", "заниматься", "занятие", "зарядка", "здоровье", "игроки", "инструктор", "йога", "канат", "качаться", "клюшка", "команда", "комплекс", "коньки", "крепыш", "кроссовки", "кубок", "лига", "лыжи", "мастер", "матч", "медаль", "метнуть", "мускулатура", "мускулы", "мышца", "мышцы", "мяч", "награда", "награждение", "необычность", "ничья", "нокаут", "нокдаун", "ныряние", "обруч", "одышка", "олимпиада", "отжимания", "пас", "первенство", "перекладина", "пионербол", "плавание", "планка", "пловец", "победа", "подача", "подвижность", "поле", "пот", "пресс", "приседание", "прыжки", "прыжок", "разбег", "раздевалка", "растяжка", "регби", "рекорд", "ринг", "рывок", "сальто", "самбо", "сборная", "связки", "секундомер", "секция", "сила", "силы", "сирфинг", "скакалка", "скалолазание", "скейтборд", "скорость", "соперничество", "соревнование", "соревнования", "спарринг", "спортзал", "спортивная", "спортивный", "спортплощадка", "спортсмен", "спортсмены", "стадион", "старт", "судья", "счет", "табло", "тайм", "танцы", "тверкинг", "тело", "теннис", "тонус", "травма", "трамплин", "тренажер", "тренер", "тренинг", "тренировка", "трибуны", "трицепсы", "труд", "турнир", "тяжеловес", "убегать", "упражнение", "упражнения", "успех", "физкультура", "финал", "финиш", "фитнес", "форма", "футбол", "футболка", "ходьба", "хоккей", "человек", "чемпион", "чемпионат", "шайба", "шахматы", "штанга", "экстрим", "энергия"};
	ru_105 = {"абзац", "автор", "азарт", "азартные", "азбука", "аквапарк", "акварель", "аккорд", "аккорды", "актёр", "актриса", "альбом", "анекдот", "аниме", "антракт", "аппаратура", "аппликация", "ария", "арт", "артист", "артистка", "арфа", "архив", "архитектор", "архитектура", "аттракцион", "афиша", "аэробика", "бал", "балалайка", "балет", "бальные", "банкет", "барабан", "барабанчик", "барабанщик", "баритон", "бас", "баскетбол", "бассейн", "бах", "баян", "бесплатные", "бестселлер", "библиотека", "библиотекарша", "библия", "билет", "биржевая", "блюз", "боевик", "боулинг", "бубен", "букварь", "буквы", "бумага", "вальс", "ваяние", "введение", "вдохновение", "велосипед", "веселье", "вечер", "вечеринка", "видео", "видеокамера", "винил", "виолончель", "вконтакте", "владеть", "возрождение", "вокал", "волейбол", "воображение", "время", "вступление", "выкройка", "выпуск", "выпускной", "выставка", "выступление", "выходные", "галерея", "гармошка", "гастроли", "героиня", "герой", "гибкость", "гимн", "гитара", "гитарист", "глава", "глина", "голливуд", "голос", "гольф", "гончар", "гравюра", "графа", "граффити", "громкая", "громко", "громкость", "группа", "гулянка", "дайвинг", "двигаться", "движение", "двор", "декорации", "дельфинарий", "дерево", "детектив", "дети", "детсад", "детская", "детские", "детство", "джаз", "диапазон", "диджей", "дизайн", "динамик", "динамика", "динамики", "дирижёр", "диск", "диско", "дисковод", "дискотека", "догонялки", "документальный", "домино", "достопримечательность", "досуг", "драма", "драматург", "друзья", "дудеть", "дудочка", "душа", "дуэт", "евровидение", "жанр", "жертвы", "живопись", "журналы", "забава", "зависимость", "заглавие", "заголовок", "зажигать", "закладка", "зал", "занятие", "запись", "застолье", "звезда", "звук", "звуки", "звукозапись", "звучание", "зители", "знание", "знания", "зодчество", "зоопарк", "зрелище", "зритель", "игра", "играть", "игрок", "игрушка", "игрушки", "издание", "издатель", "издательство", "изделие", "изобразительное", "иллюстрация", "инструмент", "инструментальная", "интеллектуал", "интересная", "интернет", "искусственный", "искусство", "искусствовед", "исполнение", "исполнитель", "исполнительница", "история", "кадр", "казино", "камера", "каникулы", "кантата", "капелла", "карандаш", "караоке", "карикатура", "картина", "картинная", "карты", "карусель", "каскадёр", "кассета", "кастинг", "кататься", "каток", "качели", "квартет", "кинематограф", "кинематография", "кино", "кинозал", "киноискусство", "кинокартина", "кинолента", "кинорежиссёр", "киностудия", "кинотеатр", "кинофестиваль", "кинофильм", "кисточка", "кисть", "клавиши", "классика", "классическая", "клип", "клише", "клоуны", "клуб", "ключ", "книга", "книги", "книжка", "книжный", "кола", "коллекция", "колонки", "колонна", "колыбельная", "команда", "комедия", "композитор", "композиция", "компьютерные", "конкурс", "конкурсанты", "консерватория", "концерт", "коньки", "костюм", "красивая", "краски", "красота", "креативщик", "кружок", "кукла", "культ", "культура", "куплет", "лагерь", "лента", "лепить", "лира", "лист", "литература", "литературовед", "лото", "любовь", "люди", "магазин", "магнитофон", "макулатура", "марш", "масло", "мастер", "мастерская", "мастерство", "маэстро", "мелодия", "мелодрама", "мемуар", "место", "метал", "ми", "микрофон", "микс", "мольберт", "монитор", "монополия", "монтаж", "мосфильм", "мотив", "муза", "музей", "музицировать", "музыка", "музыкальное", "музыкальный", "музыкант", "мультики", "мультипликация", "мультфильм", "", "мысли", "мяч", "название", "народная", "народные", "настольные", "настроение", "натура", "натюрморт", "наука", "научная", "научно-популярный", "наушники", "нирвана", "новелла", "новый", "ностальгия", "нота", "ноты", "обложка", "образ", "образование", "оглавление", "октава", "олимпийские", "опера", "оператор", "органист", "оригами", "оркестр", "оскар", "отдых", "отзыв", "отпуск", "отрывок", "очки", "памятник", "панк", "пара", "параграф", "парк", "паркет", "парные", "партнёр", "патефон", "певец", "певица", "пейзаж", "пение", "переплёт", "пересказ", "персонаж", "песенка", "песни", "песнь", "песня", "петь", "пианино", "пикник", "писатель", "писать", "планшет", "пластинка", "платье", "плеер", "плёнка", "пляски", "плясун", "плясы", "победа", "повествование", "повесть", "подлинник", "поёт", "показ", "покер", "покупать", "полиглот", "полка", "полотно", "полочка", "полька", "поп", "попкорн", "попса", "популярная", "популярные", "портрет", "портреты", "портфель", "посетитель", "посещение", "пособие", "постановка", "поцелуй", "поэзия", "поэма", "поэт", "правила", "праздник", "предисловие", "представление", "преемник", "премьера", "приключенеский", "приключение", "", "припев", "приставка", "продюсер", "проза", "прозаик", "проигрыватель", "проигрыш", "произведение", "пролог", "просмотр", "прятки", "публикация", "путешествие", "пьянка", "радио", "радиола", "радиоприёмник", "радиостанция", "радость", "развлекаться", "развлечение", "развлечения", "разворот", "раздел", "раскрака", "рассказ", "рассказы", "растяжка", "ребус", "режисер", "режиссёр", "резьба", "рейтинг", "реклама", "ренессанс", "реп", "репертуар", "репетиция", "реставрация", "рецензия", "рисование", "рисовать", "рисунки", "рисунок", "ритм", "рифма", "рифмовать", "рифмы", "рок", "ролевые", "ролики", "роль", "роман", "романтика", "романы", "рояль", "рукоделие", "рукопись", "румба", "рыбалка", "рэп", "рэпер", "рюкзак", "ряд", "сайт", "салки", "сальса", "самба", "самбо", "санки", "саундтрек", "сборник", "свадьба", "свет", "свидание", "сеанс", "секция", "сериал", "сериалы", "симфониеская", "симфония", "синтезатор", "сказка", "скейтборд", "скрипач", "скрипка", "скульптор", "скульптура", "слёзы", "слова", "словарь", "слух", "слушатель", "слушать", "смартфон", "смех", "смычок", "сноска", "сноуборд", "соавтор", "современник", "современное", "содержание", "создание", "солист", "солистка", "соло", "сольфеджио", "соседи", "сочинение", "сочинять", "спонсор", "спорт", "спортивные", "способность", "справочник", "старый", "статуэтка", "статуя", "стеллаж", "стереотруба", "стили", "стиль", "стихи", "стихотворения", "страницы", "страсть", "страх", "стрелялки", "строка", "струна", "струны", "студия", "суперзвезда", "сцена", "сценарий", "сценарист", "счастье", "съёмка", "сюжет", "такт", "талант", "тамада", "танго", "танец", "тансовщица", "танцевать", "танцор", "танцпол", "танцы", "твист", "творение", "творество", "творец", "творить", "творчество", "театр", "текст", "телевидение", "телевизор", "телезритель", "телеканал", "телекомпания", "телефон", "теннис", "тетрадь", "техника", "технология", "типография", "тир", "тираж", "титры", "тихая", "том", "тотализатор", "трагедия", "транс", "трек", "тренировка", "триллер", "труба", "труд", "тусовка", "туфли", "увлечение", "ударник", "удовольствие", "ужастик", "ужасы", "улица", "улыбка", "ум", "умник", "урок", "учёба", "учебник", "учебники", "ученик", "уют", "фантастика", "фарфор", "фестиваль", "филармония", "философ", "фильм", "фламенко", "флейта", "фокстрот", "фортепиано", "фото", "фотографии", "фрагмент", "футбол", "фэнтези", "хаус", "хит", "хобби", "хоккей", "холл", "холст", "хоп", "хор", "хорал", "хореограф", "хоровод", "хорший", "хроника", "художественное", "художество", "художник", "ценность", "цирк", "цитаты", "чарт", "частушки", "человек", "четверостишие", "читатель", "читательница", "читать", "чтение", "чувства", "чудотворец", "шансон", "шарики", "шахматы", "шашки", "шедевр", "шкатулка", "школа", "шоппинг", "шоу", "шрифт", "шут", "шутки", "экземпляр", "экран", "экспозиция", "экспонат", "экстрим", "электронная", "энциклопедия", "эпиграф", "эпизод", "эпопея", "эскиз", "эстрада", "этюд", "юмор"};
	ru_106 = {"авитаминоз", "агроном", "академик", "академическая", "академия", "алгебра", "алкоголизм", "алкоголик", "амёба", "анабиоз", "анализ", "анализы", "аналогия", "анатомия", "аппендикс", "аптека", "аптечка", "арифметика", "артерия", "аспирант", "аспирантура", "астроном", "астрономия", "атеист", "атомы", "бактерии", "бактерия", "бег", "беречь", "бесплатная", "биолог", "биологический", "биология", "биофизика", "биохимия", "болезни", "болезнь", "болеть", "больница", "больничный", "больной", "больные", "ботаник", "ботаника", "бутон", "вакцина", "вакцинация", "вектор", "вещество", "вид", "вирус", "витамины", "вода", "воздух", "восстановление", "врач", "вред", "выздоровление", "выписка", "гастроэнтеролог", "ген", "генетика", "гены", "география", "геолог", "геометрия", "геральдика", "гибрид", "гигиена", "гимнастика", "гинеколог", "гипотеза", "голень", "гормон", "градусник", "гранит", "грибы", "грипп", "гуманитарная", "давление", "дарвин", "деление", "деньги", "дерево", "диагноз", "диагностика", "диафрагма", "диета", "диплом", "дипломатия", "диссертация", "днк", "доказала", "доказательство", "доклад", "доктор", "доктрина", "доцент", "дыхание", "еда", "естественная", "желудок", "живое", "животное", "животные", "жизнь", "закалка", "закаляться", "закон", "заниматься", "зародыш", "зарядка", "звери", "здоровый", "здоровье", "здравие", "земля", "земноводное", "злоупотребление", "знания", "зож", "зоология", "зоотехника", "зрение", "зубная", "зубы", "идеология", "идея", "излечение", "изобретатель", "изобретение", "изотоп", "изучать", "изучение", "иммунитет", "инженерия", "инстинкт", "институт", "инсульт", "инфаркт", "информатика", "инфузория", "ион", "искусство", "исследование", "исследования", "историческая", "история", "исцеление", "исцелить", "йога", "кальций", "кандидат", "капельница", "кардиограмма", "кафедра", "кишка", "класс", "классификация", "клетка", "клетки", "клеточка", "клеточная", "клетчатка", "клиника", "клонирование", "книга", "колба", "консультация", "конференция", "концепция", "корни", "космос", "кости", "котопёс", "красота", "крепкое", "кровообращение", "кровь", "курение", "курильщик", "куст", "лаборант", "лаборантка", "лаборатория", "ландыш", "лауреат", "легкие", "лейкоциты", "лекарства", "лекарство", "лекарь", "лес", "лечение", "лечить", "лечиться", "ликбез", "лингвист", "литература", "логика", "ломоносов", "лор", "люди", "лягушка", "магистр", "магистратура", "математика", "материализм", "медик", "медицина", "медсестра", "мембрана", "метод", "методика", "методология", "метрика", "механика", "микроб", "микробиология", "микробы", "микроорганизм", "микроскоп", "микрочастицы", "мир", "мировоззрение", "мифология", "млекопитающие", "мозг", "мозги", "молекула", "молекулы", "молекулярная", "молодость", "монография", "мох", "мрт", "мускулы", "мутант", "мутация", "мышца", "мышцы", "наблюдение", "навигация", "наклонность", "нанотехнологии", "насекомые", "наследственность", "наука", "научная", "научные", "научный", "невролог", "неврология", "недуг", "нейтрон", "нерв", "нетрадиционная", "нобелевская", "номенклатура", "ньютон", "область", "облучение", "оболочка", "образ", "обсерватория", "обследование", "обучение", "овощи", "одноклеточный", "операция", "опыт", "опыты", "орбиталь", "орган", "организм", "органы", "освоение", "особь", "осязание", "открытие", "отоларинголог", "отрасль", "офтальмолог", "оценка", "очки", "палата", "папоротник", "параграф", "парадокс", "паста", "патология", "пенициллин", "пестик", "печень", "питание", "пищеварение", "планктон", "позвоночник", "поколение", "поликлиника", "понятие", "пофессор", "почки", "практика", "предмет", "премия", "премудрость", "препарат", "препараты", "преподаватель", "прием", "прикладная", "природа", "природоведение", "пробирка", "пробирки", "прогресс", "происхождение", "прорыв", "просвещение", "простуда", "протон", "профессор", "профилактика", "психическое", "психология", "птицы", "публицистика", "пульс", "работа", "развитие", "разложение", "размножение", "разновидность", "разум", "рак", "раствор", "растение", "растения", "рацион", "реабилитация", "реактивы", "реакция", "рёбра", "режим", "рентген", "рефлекс", "рецепт", "рецептор", "роботы", "роддом", "руководитель", "рыбы", "самосохранение", "самочувствие", "санаторий", "светило", "сегмент", "секреция", "селекционер", "семантика", "семейство", "сердце", "сила", "симпозиум", "синтез", "сионизм", "скелет", "скорая", "слабость", "следить", "слух", "смерть", "современная", "сон", "состояние", "сотрудник", "социум", "специфика", "среда", "стамотолог", "старость", "статистика", "степень", "страхование", "строение", "структура", "студент", "сустав", "таблетки", "тело", "температура", "теорема", "теоретик", "теория", "терапевт", "терапия", "термин", "терминология", "термодинамика", "техника", "технология", "тонус", "точная", "трава", "травма", "трактат", "трансцендентность", "тригонометрия", "труд", "тычинка", "тяготение", "углеводород", "углеводы", "угроза", "узи", "укол", "укрепление", "ум", "умный", "университет", "упражнение", "урок", "ухудшение", "учёба", "учебник", "учебники", "учение", "ученик", "учения", "учёные", "учёный", "учитель", "учить", "учиться", "фаза", "факт", "фауна", "феномен", "фермент", "физик", "физика", "физиология", "физиотерапия", "физкультура", "филолог", "филология", "философ", "философия", "фитнес", "флора", "флюорография", "формула", "формулы", "фотон", "фотосинтез", "фразеологизм", "фразеология", "фрукты", "фундаментальная", "халат", "химия", "хирург", "хлороформ", "хромосома", "хронология", "царство", "цветы", "целлюлоза", "цитология", "частица", "частицы", "челмедведосвин", "человек", "чеснок", "чистота", "чудо", "школа", "шприц", "эволюция", "эволюцонная", "эйнштейн", "экг", "экзамен", "эколог", "экология", "экспедиция", "эксперимент", "эксперименты", "эмпирическая", "эндокринолог", "эритроциты", "этика", "ядро", "язык", "языкознание"};
}

void ReadEnDatabase() {
	en_001 = {"recently", "yesterday", "today", "now", "on the eve", "earlier", "later", "now", "this week", "last week", "this month", "this year", "on monday", "on tuesday", "on wednesday", "on thursday", "on friday", "on saturday", "on sunday"};
	en_002 = {"arrested", "was running", "was running", "talked", "bothered", "beat", "thanked", "shone", "was ill", "mumbled", "took", "wandered around", "threw", "threw", "have been", "was", "wallowed", "cooked", "introduced", "introduced", "led", "ordered", "believed", "returned", "weighed", "looked", "sighed", "took", "seen", "saw", "hung", "included", "turned on", "owned", "influenced", "invested", "contributed", "drove", "fought", "returned", "led", "arose", "arose", "objected", "objected", "worried", "exclaimed", "perceived", "restored", "lied", "jumped up", "opened", "recalled", "remembered", "got up", "got up", "met", "met", "entered", "entered", "went in", "chose", "chose", "threw away", "brought out", "looked", "gave out", "gave out", "highlighted", "singled out", "withstood", "survived", "caused", "caused", "won", "endured", "forced", "took out", "fell out", "drank", "performed", "performed", "jumped out", "let out", "released", "expressed", "expressed", "raised", "tore out", "cut out", "expressed", "jumped out", "listened", "put up", "performed", "made a", "pulled out", "pulled out", "revealed", "found out", "guaranteed", "perished", "looked", "looked", "drove", "bent", "said", "burned", "cooked", "threatened", "walked", "gave", "gave", "gave", "moved", "moved", "acted", "did", "shared", "demonstrated", "held", "added", "added", "finished off", "finished off", "got", "brought", "trusted", "agreed", "proved", "argued", "reported", "allowed", "allowed", "served", "got out", "delivered", "took out", "reached", "reached", "reached", "trembling", "was friends", "was thinking", "breathed", "traveled", "rode", "regretted", "complained", "was waiting", "wished", "married", "lived", "took away", "got sick", "cared", "took away", "forgot", "forgot", "started", "wrapped up", "completed", "curled", "depended", "looked in", "looked in", "bent", "spoke up", "asked", "asked", "delayed", "conceived", "conceived", "interested in", "ordered", "ordered", "finished", "concluded", "concluded", "finished", "screamed", "closed", "closed", "lit up", "laid", "replaced", "measured", "noticed", "noticed", "fell silent", "held", "occupied", "recorded", "recorded", "cried", "paid", "filled up", "remembered", "forbade", "jumped up", "earned", "earned", "registered", "deserved", "laughed", "asleep", "made", "made", "shot dead", "stepped in", "fell asleep", "captured", "came in", "wanted to", "read out", "defended", "defended", "declared", "stated", "called", "called", "sounded", "hello", "knew", "meant", "played", "delivered", "escaped", "elected", "sorry", "published", "issued", "outlined", "changed", "portrayed", "portrayed", "studied", "studied", "had", "interested in", "was looking for", "ruled out", "performed", "performed", "used", "fixed", "scared", "experienced", "experienced", "explored", "proceeded", "disappeared", "faded away", "nodded", "nodded", "threw", "put", "commanded", "controlled", "finished", "cumshot", "fed", "shouted", "screamed", "twisted", "bought", "smoked", "oversaw", "lay", "was flying", "was flying", "treated", "deprived", "caught", "broke", "I loved", "waved", "changed", "dreamed", "interfered", "mined", "passed", "prayed", "was silent", "tormented", "washed", "was gaining", "watched", "scored", "allotment", "tired of", "called", "appointed", "called", "flew in", "poured", "printed", "wrote", "filled up", "resembled", "reminded", "sent", "drew", "violated", "violated", "insisted", "was advancing", "has come", "taught", "found", "started", "started", "hated", "wore", "wrapped", "provided", "provided", "promised", "offended", "possessed", "cheated", "discovered", "hugged", "robbed", "outlined", "pleased", "formed", "formed", "drew", "drew", "found", "laughed", "discussed", "discussed", "determined", "combined", "announced", "explained", "explained", "obliged", "looked around", "limited", "clothed", "put on", "expected", "meant", "provided", "provided", "graduated", "shouted", "surrounded", "surrounded", "outstripped", "described", "described", "defined", "determined", "published", "lowered", "screaming", "organized", "lit up", "freed", "mastered", "founded", "founded", "left", "left", "stopped", "stopped", "carried out", "carried out", "took away", "turned away", "answered", "answered", "gave", "gave", "rested", "was resting", "refused", "refused", "opened", "opened", "distinguished", "put off", "canceled", "noted", "noted", "attributed", "took away", "withdrew", "tore off", "sent", "sent", "let go", "reflected", "snapped", "was absent", "lectured", "designed", "swept", "appreciated", "appreciated", "felt", "felt", "fell", "smelled", "sang", "interrupted", "translated", "flipped over", "translated", "bent over", "spoke", "passed on", "handed over", "moved", "worried", "survived", "outplayed", "shifted", "blocked", "flew over", "shifted", "reprinted", "jumped over", "processed", "redefined", "reviewed", "stopped", "stopped", "stepped over", "counted", "danced", "went over", "crossed out", "re-read", "drank", "wrote", "swam", "cried", "planned", "paid", "swam", "ran about", "won", "ran", "shaved", "visited", "led", "believed", "turned", "hung", "repeated", "repeated", "raised", "fortunetelling", "looked", "glanced", "talked", "walked", "filed", "filed", "gave", "let down", "prepared", "gave in", "supported", "supported", "shared", "subject to", "raised", "raised", "picked up", "waited", "suspected", "signed", "confirmed", "confirmed", "thought", "picked up", "fit", "emphasized", "emphasized", "went", "regretted", "wished", "called", "allowed", "allowed", "called", "congratulated", "congratulated", "cognized", "introduced", "caught", "showed", "showed", "shook", "left", "covered", "bought", "believed", "flew", "put", "was getting", "got", "fell in love", "prevented", "remembered", "helped", "helped", "was silent", "understood", "got it", "promised", "hit", "hit", "tried", "asked for", "tried to", "struck", "decided", "instructed", "planted", "dedicated", "visited", "visited", "sat", "sent", "followed", "listened", "looked", "advised", "set", "stood", "Suffered", "built", "acted", "entered", "sent", "danced", "lost", "spent", "demanded", "pulled", "was like", "prettier", "kissed", "read", "felt", "went", "explained", "turned", "turned", "exceeded", "foresaw", "suggested", "proposed", "intended", "provided", "provided", "prevented", "assumed", "suggested", "preferred", "introduced", "represented", "was to", "warned", "warned", "provided for", "provided", "presented", "stopped", "transformed", "overcame", "interrupted", "has undergone", "added", "nailed", "brought closer", "arrived", "brought", "attracted", "brought", "invited", "looked", "drove", "bent down", "cooked", "attached", "held", "invented", "came", "had arrived", "pressed", "called for", "recognized", "recognized", "called for", "ordered", "covered up", "applied", "applied", "belonged", "took", "brought", "has accepted", "I bought", "crouched", "sent", "stuck", "started", "was present", "came", "tried", "muttered", "spent", "checked", "checked", "spent", "accompanied", "spoke", "was selling", "sold", "demonstrated", "continued", "continued", "lived", "lived", "sounded", "lost", "produced", "produced", "uttered", "uttered", "occurred", "gone", "missed", "requested", "listened to", "forgave", "stuck", "contradicted", "held out", "passed", "read", "whispered", "forgave", "showed", "showed", "hopped", "hid", "scarecrow", "let", "let", "tortured", "worked", "pleased", "smashed", "assorted", "woke up", "spread", "unfolded", "hung out", "developed", "discerned", "looked at", "talked", "handed out", "undressed", "shared", "shared", "laid out", "cleared mine", "reflected", "disassembled", "developed", "struck", "allowed", "destroyed", "wounded", "rocked", "revealed", "threw open", "disposed of", "located", "distributed", "spread", "told", "told", "considered", "considered", "shot", "reasoned", "calculated", "counted", "disbanded", "expanded", "tore up", "reacted", "implemented", "recommended", "decided", "I decided", "risked", "drew", "gave birth", "led", "collapsed", "shot down", "dropped", "brought", "rolled up", "testified", "tied up", "tied", "handed over", "passed", "done", "made friends", "sat down", "sat", "shone", "said", "stacked up", "hid", "hid", "watched", "followed", "folded up", "broke", "served", "deceived", "I heard", "replaced", "watched", "filmed", "stripped off", "collected", "collected", "committed", "committed", "advised", "coincided", "contained", "connected", "created", "created", "reduced", "realized", "reported", "reported", "corresponded", "accompanied", "made up", "made up", "consisted", "kept", "kept", "slept", "saved", "in a hurry", "argued", "contributed to", "managed", "asked", "asked", "hid", "lowered", "lowered", "compared", "set", "has become", "embarrassed", "was worth", "pushed", "stood", "suffered", "shot", "built", "pounded", "judged", "managed to", "put it", "existed", "formulated", "grabbed", "went down", "considered", "ate", "played", "was dancing", "dragged", "created", "endured", "was losing", "poked", "traded", "in a hurry", "sticking out", "was spending", "demanded", "touched", "touched", "pulled", "convinced", "ran away", "killed", "killed", "removed", "decreased", "respected", "increased", "assured", "had seen", "guessed", "deleted", "hit", "paid", "kept", "held", "surprised", "surprised", "left", "recognized", "found out", "pointed out", "pointed out", "stole", "was able", "was dying", "destroyed", "fell", "mentioned", "drove", "heard", "fell asleep", "had time", "managed", "reassured", "tired", "installed", "set", "arranged", "arranged", "inferior", "approved", "claimed", "specified", "lost", "went away", "participated", "took into account", "taught", "considered", "understood", "formed", "grabbed", "was enough", "went", "wanted to", "laughed", "kept", "kissed", "appreciated", "read", "felt", "whispered", "joked", "revealed"};
	en_003 = {"drove", "introduced", "increased", "rendered", "skidded", "disappeared", "disappeared", "lay down", "lez", "could", "inflicted", "carried", "carried", "suffered", "drove", "died", "climbed", "carried", "comprehended", "sheared", "shocked", "brought", "attracted", "used to", "brought", "uttered", "off", "destroyed", "grew up", "smog", "saved", "tech", "has died"};
	en_004 = {"interviewed", "bothered", "beat", "thanked", "borol", "was afraid", "threw", "threw", "wallowed", "cooked", "introduced", "led", "ordered", "returned", "weighed", "took", "saw", "included", "turned on", "invested", "returned", "objected", "worried", "exclaimed", "took advantage", "restored", "got up", "met", "met", "entered", "chose", "chose", "threw away", "brought out", "gave out", "gave out", "highlighted", "singled out", "withstood", "caused", "endured", "took out", "performed", "performed", "let out", "released", "expressed", "expressed", "tore out", "expressed", "put up", "made a", "pulled out", "pulled out", "revealed", "bent", "cooked", "threatened", "gave", "moved", "moved", "did", "shared", "held", "length", "added", "added", "finished off", "finished off", "got", "trusted", "guessed", "guessed", "agreed", "rained", "waited", "inquired", "allowed", "allowed", "served", "got out", "delivered", "took out", "complained", "married", "took away", "lost", "cared", "took away", "forgot", "started", "wrapped up", "completed", "curled", "looked in", "bent", "spoke up", "asked", "asked", "delayed", "conceived", "conceived", "interested in", "ordered", "finished", "concluded", "concluded", "finished", "closed", "closed", "replaced", "held", "occupied", "recorded", "recorded", "filled up", "remembered", "earned", "registered", "deserved", "laughed", "doubted", "shot dead", "stepped in", "fell asleep", "defended", "defended", "declared", "stated", "called", "played", "delivered", "elected", "sorry", "published", "issued", "outlined", "changed", "portrayed", "portrayed", "studied", "studied", "had", "interested in", "ruled out", "performed", "performed", "used", "fixed", "scared", "experienced", "explored", "showed", "touched", "put", "controlled", "finished", "cumshot", "touched", "twisted", "oversaw", "treated", "deprived", "caught", "laid down", "broke", "changed", "interfered", "tormented", "washed", "was gaining", "watched", "put on", "called", "called", "flew in", "filled up", "resembled", "reminded", "sent", "drew", "violated", "violated", "insisted", "taught", "found", "started", "wore", "liked", "needed", "wrapped", "provided", "provided", "offended", "cheated", "discovered", "hugged", "outlined", "pleased", "formed", "formed", "drew", "drew", "discussed", "communicated", "combined", "announced", "explained", "explained", "looked around", "looked around", "limited", "clothed", "put on", "provided", "provided", "shouted", "surrounded", "surrounded", "feared", "leaned", "described", "described", "recalled", "defined", "determined", "published", "lowered", "organized", "lit up", "freed", "mastered", "founded", "founded", "left", "left", "stayed", "stopped", "stopped", "carried out", "carried out", "took away", "turned away", "gave", "refused", "refused", "opened", "opened", "distinguished", "canceled", "noted", "noted", "withdrew", "tore off", "sent", "sent", "reflected", "lectured", "designed", "swept", "appreciated", "a mistake", "felt", "felt", "interrupted", "translated", "flipped over", "translated", "looked at", "bent over", "spoke", "passed on", "shifted", "blocked", "reviewed", "stepped over", "counted", "overworked", "cried", "planned", "led", "believed", "turned", "hung", "repeated", "repeated", "raised", "filed", "let down", "prepared", "gave in", "supported", "raised", "raised", "suspected", "signed", "confirmed", "confirmed", "picked up", "emphasized", "introduced", "interested", "showed", "showed", "shook", "covered", "bought", "believed", "put", "was getting", "used", "fell in love", "prevented", "required", "liked", "hit", "tried to", "struck", "instructed", "dedicated", "listened", "heard", "advised", "set", "tried", "sent", "lost", "demanded", "bother", "pulled", "kissed", "felt", "appeared", "appeared", "turned", "turned", "suggested", "provided", "provided", "assumed", "introduced", "represented", "was to", "provided", "stopped", "transformed", "interrupted", "added", "nailed", "brought closer", "attracted", "brought", "invited", "looked", "bent down", "cooked", "attached", "held", "invented", "pressed", "called for", "recognized", "recognized", "called for", "covered up", "applied", "applied", "took", "brought", "has accepted", "crouched", "listened", "suffered", "came", "muttered", "checked", "checked", "spent", "spoke", "was selling", "sold", "continued", "continued", "lost", "produced", "produced", "uttered", "woke up", "forgave", "held out", "passed", "forgave", "showed", "showed", "hid", "scarecrow", "let", "tortured", "pleased", "ran", "smashed", "assorted", "spread", "unfolded", "hung out", "developed", "looked at", "handed out", "undressed", "shared", "laid out", "cleared mine", "disassembled", "developed", "struck", "allowed", "rocked", "commanded", "revealed", "threw open", "burst into tears", "disposed of", "located", "distributed", "spread", "considered", "laughed", "considered", "broke up", "disbanded", "calculated", "counted", "expanded", "tore up", "implemented", "recommended", "decided", "I decided", "gave birth", "gave birth", "led", "shot down", "dropped", "brought", "rolled up", "tied up", "handed over", "passed", "done", "made friends", "said", "stacked up", "passed away", "hid", "hid", "folded up", "broke", "happened", "happened", "I heard", "replaced", "laughed", "watched", "snailed", "filmed", "stripped off", "collected", "collected", "committed", "advised", "agreed", "agreed", "contained", "connected", "created", "created", "reduced", "doubted", "accompanied", "consisted", "kept", "kept", "in a hurry", "managed", "hid", "lowered", "lowered", "compared", "became", "tried to", "embarrassed", "pushed", "sought", "built", "pounded", "put it", "formulated", "went down", "considered", "dragged", "created", "was losing", "traded", "in a hurry", "demanded", "touched", "labored", "pulled", "convinced", "ran away", "killed", "removed", "increased", "guessed", "managed", "daring", "deleted", "hit", "kept", "surprised", "surprised", "bothered", "recognized", "pointed out", "smiled", "smiled", "destroyed", "drove", "sat down", "chuckled", "reassured", "set", "installed", "set", "arranged", "arranged", "approved", "claimed", "taught", "considered", "formed", "grabbed", "was enough", "kept", "kissed", "felt", "felt", "whispered", "revealed"};
	en_101 = {"traffic police", "accident", "drivers", "people", "people", "man", "society", "communication", "public", "social science", "Group", "community", "company", "friends", "a country", "crowd", "school", "world", "family", "state", "thing", "lesson", "politics", "to communicate", "law", "Job", "conversation", "environment", "town", "right", "sociology", "the collective", "a life", "community", "power", "opinion", "the culture", "lot", "collection", "population", "personality", "organization", "public", "knowledge", "the general", "firm", "common", "friendship", "individual", "regulations", "interests", "civilization", "humanity", "children", "morality", "cell", "the class", "nation", "team", "democracy", "social", "collection", "shine", "higher", "relationship", "consumption", "elite", "cream", "female", "Man", "transport", "social", "land", "money", "story", "commune", "communication", "social science", "citizens", "a circle", "weight", "the science", "Street", "study", "love", "rally", "Colleagues", "child", "commonality", "behavior", "an association", "partnership", "a responsibility", "member", "word", "system", "theatre", "together", "circle", "the consignment", "the president", "deputy", "state", "politician", "elections", "a country", "thought", "law", "power", "the consignment", "democracy", "war", "parliament", "the minister", "political", "people", "debate", "world", "constitution", "government", "people", "corruption", "mayor", "politicians", "official", "society", "meeting", "voting", "control", "glad", "the rights", "monarchy", "the governor", "decree", "court", "senate", "Ward", "diplomat", "ministry", "system", "bribe", "agitation", "candidate", "political scientist", "ruler", "conversation", "political science", "external", "internal", "chapter", "ambassador", "advice", "mandate", "taxes", "prime", "sanctions", "opposition", "federation", "diplomacy", "leader", "code", "summit", "power", "contract", "chancellor", "Politburo", "repression", "socialism", "reform", "the pact", "federalism", "doctrine", "consul", "socialist", "manifesto", "anarchy", "sovereignty", "NATO", "senator", "ideology", "Marxism", "capitalism", "Secretary General", "countries", "UN", "authoritarian", "communist", "Communist Party", "restructuring", "revolution", "deputies", "bureaucracy", "residence", "presidency", "republic", "moratorium", "declaration", "authority", "the chairman", "governing body", "City Hall", "reformer", "congress", "militia", "embassy", "the committee", "protest", "advisor", "slogan", "candidacy", "nationalist", "the president", "deputy", "elections", "voting", "vote", "to choose", "candidate", "debate", "newsletter", "the consignment", "vote", "thought", "power", "parliament", "voter", "mayor", "a country", "democracy", "referendum", "agitation", "nominee", "candidacy", "deputies", "inauguration", "sample", "politician", "mandate", "chosenness", "party member", "party", "fraction", "urn", "falsification", "leaflet", "challenger", "presidency", "most", "the governor", "selection", "headquarters", "official", "City Hall", "the chairman", "observer", "government", "the minister", "senator", "state", "company", "Politburo", "party card", "congress", "propaganda", "communist", "meeting", "citizen", "governing body", "slogan", "delegation", "socialism", "the committee", "presidium", "rating", "republic", "position", "rally", "collection", "coat of arms", "lot", "participant", "chancellor", "publicity", "bureaucracy", "minority", "crowd", "participation", "opinion", "conversation", "plot", "total", "Liberty", "court", "constitution", "right", "the rule", "judge", "code", "order", "lawyer", "prison", "state", "lawyer", "violation", "law", "police", "Legislation", "the crime", "power", "violate", "the prosecutor", "prosecutors office", "police", "punishment", "criminal", "thought", "man", "decree", "charter", "a country", "thief", "vault", "follow", "ban", "protection", "legislator", "sentence", "parliament", "legality", "intruder", "justice", "compliance", "fine", "document", "legalist", "iniquity", "defendant", "law", "regularity", "people", "physics", "deputy", "prosecutors office", "order", "Liberty", "society", "Adoption", "take", "subordination", "obedience", "bill", "decree", "legally", "upset", "murder", "citizen", "illegally", "a business", "arrest", "norm", "true", "to accept", "bailiff", "criminal", "criminal", "robbery", "prisoner", "restriction", "the rights", "regulations", "laws", "justice", "manifesto", "policeman", "amendment", "mayhem", "statement", "crime", "corruption", "criminal", "criminal", "smuggling", "declaration", "crime", "bribe", "moratorium", "doctrine", "demand", "non-compliance", "amnesty", "understood", "City Hall", "intruder", "authority", "authority", "fake", "theft", "fraud", "blackmail", "convicted", "protocol", "governing body", "investigator", "the department", "disposition", "verdict", "damage", "kidnapper", "condition", "dictatorship", "client", "prosecutor", "con man", "accusation", "accident", "happening", "event", "trouble", "occurred", "fire", "flood", "death", "accident", "adventure", "the procession", "murder", "situation", "car", "tragedy", "bad", "woe", "catastrophe", "emergency", "It happened", "earthquake", "horror", "flooding", "road", "hospital", "danger", "fight", "theft", "badly", "sadness", "Hurricane", "incident", "wreck", "protocol", "misfortune", "road", "eyewitnesses", "events", "sensation", "witness", "misunderstanding", "trouble", "chronicle", "circumstance", "panic", "understood", "props", "reportage", "mystery", "cataclysm", "hitting", "episode", "phenomenon", "shock", "ditch", "Adventures", "injured", "culprit", "witnesses", "disaster", "consequence", "confluence", "indication", "the passage", "precedent", "epic", "accomplishment", "gai", "anxiety", "confluence", "indication", "involvement", "act", "consequence", "news", "fencing", "detail", "surprise", "eyewitness", "punishment", "murder", "criminal", "jail", "court", "thief", "police", "theft", "theft", "law", "police", "killer", "term", "pistol", "lawyer", "book", "judge", "robbery", "the prosecutor", "handcuffs", "violation", "robbery", "criminal", "bank", "ax", "bandit", "man", "a business", "ooh", "evidence", "weapons", "razoy", "article", "crime", "zone", "alibi", "arrest", "money", "camera", "death", "act", "investigator", "the fault", "punishment", "hijacking", "execution", "blood", "a place", "motive", "novel", "trait", "code", "bad", "judge", "sentence", "criminal", "rape", "jury", "criminal", "disclosure", "partner in crime", "investigation", "impunity", "witnesses", "suspect", "criminal", "witness", "accomplice", "blackmail", "misconduct", "suspicion", "consequence", "crime", "understood", "affect", "intruder", "involvement", "relapse", "tip", "abduction", "attempt", "follow", "committing", "search", "defendant", "theft", "accused", "accusation", "client", "prints", "fingers", "kill", "exposure", "smuggling", "hooliganism", "eyewitness", "prisoner", "act", "testimony", "mayhem", "detective", "indication", "convicted", "interrogation", "fraud", "hitting", "victim", "beatings", "appropriation", "culprit", "handcuff", "shackles", "hostage", "kidnapper", "witness", "gallows", "fraud", "detention", "scam", "amnesty", "setup", "attack", "defendant", "prosecutors office", "operative", "wanted", "collusion", "execution", "protocol", "executioner", "gang", "detective", "evidence", "maniac", "consequence", "screams", "culprit", "chantrap", "corruption", "policeman", "prosecutor", "intruder", "track", "sin", "disassembly", "violence", "precinct", "prisoner", "intent", "robber", "inquisition", "the colony", "mafia", "violence", "the Punisher", "act of terrorism", "poacher", "statement"};
	en_102 = {"the store", "economy", "money", "economist", "saving", "politics", "save", "the science", "a country", "thing", "a crisis", "budget", "bank", "finance", "state", "dollar", "currency", "Euro", "economy", "maths", "market", "business", "ruble", "ruble", "rubles", "credit", "Job", "score", "resident", "macroeconomics", "institute", "inflation", "salary", "accountant", "lesson", "school", "accounting", "debit", "economical", "study", "capital", "score", "economical", "income", "figures", "taxes", "world", "price", "oil", "sale", "recession", "power", "course", "people", "accounting", "schedule", "development", "trade", "household", "economical", "microeconomics", "gdp", "exchange", "demand", "product", "purse", "the minister", "profit", "textbook", "society", "profession", "university", "government", "economic", "height", "defaulted", "gold", "payment", "man", "export", "manager", "wealth", "discipline", "sentence", "company", "social science", "investments", "fund", "stocks", "scope", "spending", "import", "consumption", "costs", "resources", "control", "university", "debt", "work", "coffers", "market", "bazaar", "money", "seller", "the products", "product", "trade", "vegetables", "fruits", "sale", "clothes", "things", "score", "customer", "purchase", "meat", "bargain", "people", "food", "price", "counter", "economy", "buy", "a fish", "exchange", "tent", "crowd", "sell", "grandmothers", "dealer", "Libra", "grandmas", "fair", "tomatoes", "Job", "hachi", "noise", "watermelon", "shop", "people", "exchange", "bargaining", "huckster", "footwear", "cheap", "buy", "discounts", "business", "labor", "stall", "berries", "stocks", "currency", "sales", "package", "demand", "greenery", "the market", "cucumbers", "profit", "man", "potatoes", "marketing", "relationship", "to bargain", "tray", "ranks", "town", "merchant", "import", "milk", "gypsies", "turn", "cost", "sell-out", "competition", "sentence", "wholesale", "mud", "screams", "purchase", "lot", "surrender", "a bag", "bringing", "apples", "sunflower seeds", "export", "trade", "melon", "chock", "vegetable", "pears", "cheating", "a hen", "flea market", "cheapness", "commerce", "production", "saleswoman", "grocery", "money", "bank", "credit", "salary", "Job", "romances", "economy", "income", "financier", "dollar", "wealth", "accountant", "banker", "purse", "score", "coins", "budget", "business", "currency", "Euro", "ruble", "financing", "bill", "contribution", "profit", "capital", "stocks", "gold", "a crisis", "debt", "exchange", "economist", "ministry", "purchase", "grandmas", "map", "accounting", "office", "lot", "a country", "costs", "think", "paper", "few", "accounting", "loot", "family", "car", "consumption", "mortgage", "man", "saving", "documentation", "investments", "food", "people", "spending", "firm", "the minister", "company", "facilities", "financial", "the property", "deposit", "sing", "cans", "coffers", "penny", "score", "ATM", "director", "apartment", "politics", "earnings", "state", "interest", "house", "prepaid expense", "debit", "to find", "tax", "report", "balance", "to occupy", "little thing", "pension", "rich", "expenses", "cabbage", "cash", "get", "millionaire", "accumulation", "saving", "a business", "the attachment", "audit", "oil", "the amount", "payment", "money", "businessman", "Job", "a business", "profit", "office", "businessman", "sale", "bank", "plan", "income", "partner", "man", "businesswoman", "director", "firm", "secretary", "stocks", "a life", "tax", "people", "company", "lady", "company", "worker", "work", "career", "salary", "building", "suit", "earnings", "his", "credit", "car", "wealth", "idea", "success", "score", "contract", "production", "center", "trade", "documentation", "economy", "purchase", "Chief", "entrepreneurship", "small", "product", "currency", "capital", "corporation", "house", "boss", "lunch", "project", "power", "the class", "paper", "a meeting", "Man", "finance", "work", "competition", "dollar", "men", "risk", "plant", "startup", "staff", "organization", "chef", "time", "deal", "services", "bankrupt", "tie", "occupation", "manager", "development", "table", "loot", "exchange", "female", "cabinet", "Colleagues", "oligarch", "training", "a computer", "profession", "conversation", "the game", "contribution", "cheating", "market", "glory", "rent", "client", "consumption", "lesion"};
	en_103 = {"website", "application", "screenshot", "register", "technology", "Technics", "technologist", "lesson", "work", "production", "the science", "techno", "thing", "Job", "a computer", "school", "process", "nano", "car", "new", "manufacturing", "way", "progress", "cooking", "plant", "Group", "logics", "technician", "phone", "robot", "development", "technological", "development", "man", "new", "technical", "mechanism", "TV", "invention", "technological", "to sew", "innovation", "method", "do", "order", "scheme", "sewing", "teacher", "technologies", "the Internet", "breakthrough", "skill", "the choice", "the rule", "innovation", "art", "modern", "mastery", "novelty", "study", "methodology", "instruction", "nanotechnology", "Japan", "physics", "the control", "product", "future", "the tablet", "a business", "action", "century", "plan", "iPhone", "chemistry", "scientists", "engineer", "algorithm", "technical College", "performance", "industry", "appliance", "production", "people", "sequence", "scientist", "quality", "treatment", "methodology", "magic", "master", "know-how", "apparatus", "industry", "system", "complex", "factory", "profession", "needlework", "electronics", "equipment", "time", "laser", "cardboard", "idealization", "radio interception", "stabilization", "malfunctions", "user", "button", "builder", "tactician", "sensor", "launch", "inauguration", "phone", "the tablet", "a computer", "smartphone", "iPhone", "a laptop", "player", "the Internet", "technologies", "Technics", "android", "the game", "clock", "communication", "navigator", "electronics", "novelty", "TV", "mouse", "gadgets", "keyboard", "device", "fashion", "listen", "man", "headphones", "mobile", "century", "progress", "inspector", "innovation", "console", "modernity", "special agent", "mobile phone", "apparatus", "charge", "appliance", "technology", "car", "wheel", "car", "road", "driver", "steering wheel", "bus", "machine", "engine", "go", "speed", "petrol", "gas", "brake", "a door", "car wash", "the rights", "mark", "tram", "transport", "tires", "robot", "salon", "riding", "underground", "Taxi", "accident", "to drive", "to ride", "track", "passenger", "clutch", "hood", "chauffeur", "box", "purchase", "seat", "man", "traffic", "spare part", "motorcycle", "bike", "autobahn", "cars", "car mechanic", "authoritarian", "car", "autopilot", "service", "motor depot", "motorist", "auto parts", "motorway", "Mercedes", "pen", "foreign car", "wheelbarrow", "limousine", "Audi", "Mercedes Benz", "machine gunner", "headlights", "parking", "cars", "BMW", "camber", "trunk", "subcompact", "autograph", "highway", "driving", "garage", "gelding", "stuffing box", "authority", "sales", "fret", "body", "gas station", "racer", "gazelle", "race", "turn", "gai", "gas station", "battery", "Stop", "bolts", "motor", "kamaz", "truck", "headlamp", "insurance", "sheathing", "Lada", "the tire", "motorcade", "race", "shock absorber", "typewriter", "vinyl", "fort", "suspension", "ditch", "traveling", "gear", "prototype", "muffler", "biography", "expensive", "locksmith", "check out", "detail", "pedal", "border", "passengers", "buyer", "amateur", "traffic regulations", "movement", "radiator", "taxi driver", "signaling", "hire", "parking", "disassembly", "lever arm", "owner", "diagnostics", "arrival", "van", "six", "polishing", "the details", "column", "Technics", "wheels", "rubber", "the game", "addition", "phone", "a computer", "program", "the Internet", "free", "screen", "bonus", "scheme", "download", "accessory", "the tablet", "instagram", "the attachment", "update", "version", "user", "mobile phone", "mobile", "message", "net", "site", "a computer", "communication", "connection", "games", "google", "information", "web", "contact", "classmates", "browser", "Search", "Yandex", "modem", "video", "a laptop", "phone", "cable", "movies", "people", "post office", "wikipedia", "provider", "friends", "music", "chat room", "acquaintance", "addiction", "router", "facebook", "time", "Job", "traffic", "social network", "Pictures", "speed", "keyboard", "world", "the tablet", "man", "instagram", "internet", "study", "twitter", "page", "wires", "mouse", "the mouse", "knowledge", "help", "server", "monitor", "search engine", "posts", "the web", "a photo", "link", "torrent", "program", "online", "ip", "the blog", "comp", "mail", "a life", "opera", "the answers", "tweeter", "Wi-Fi", "score", "worldwide", "telegram", "compound", "technologies", "connection", "wireless", "quick", "mobile", "memes", "spam", "domain", "selfie", "access", "a printer", "surfing", "hosting", "host", "online", "system administrator", "forum", "smiley face", "hacker", "in contact with", "smile", "computerization", "computer science", "the wire", "limit", "mobile phone", "programmer", "portal", "the content", "file", "password", "like", "CPU", "cell", "signalman", "message", "gadget", "setting", "request", "TV series", "charging", "rate", "announcement", "attachment", "a source", "availability", "report", "pages", "globalization", "synchronization", "to study", "interest", "antenna", "civilization", "profile", "communication", "glitch", "to chat", "Spread", "tutorial", "resources", "picture", "to seek", "grid", "electricity", "polyglot", "leisure", "sway", "status", "navigation", "subscriber", "interlocutor", "sms", "publication", "system", "roller", "world", "virus", "know", "interpreter", "service", "technology", "sim card", "flash drive", "broadcast", "customization", "foxtrot", "transmitter", "use"};
	en_104 = {"football", "run", "basketball", "athlete", "health", "volleyball", "ball", "hockey", "competition", "the game", "olympiad", "tennis", "force", "trainer", "swimming", "skiing", "boxing", "victory", "training", "jumping", "a life", "sports", "champion", "medal", "chess", "muscles", "sneakers", "athletics", "match", "barbell", "championship", "injury", "physical Culture", "judge", "team", "gymnastics", "stadium", "the gym", "golf", "dancing", "skates", "fitness", "biathlon", "racket", "to engage", "Hall", "rugby", "fight", "dumbbells", "bike", "sweat", "handball", "occupation", "training apparatus", "Goal", "water", "record", "reward", "press", "the finish", "the form", "tournament", "man", "work", "athlete", "start", "goal", "hockey stick", "muscles", "fans", "cup", "washer", "dope", "traffic", "jump rope", "speed", "cycling", "endurance", "spirit", "time", "baseball", "achievements", "field", "body", "race", "success", "swimming pool", "exercises", "weight", "the players", "world", "pain", "score", "master", "shell", "walking", "charging", "half", "cleats", "running", "run", "bars", "section", "gymnast", "aerobics", "push ups", "squatting", "sports", "athletes", "crossbar", "competitions", "sports ground", "movements", "flexibility", "forces", "an exercise", "stretching", "triceps", "run", "bounce", "throw", "volleyball player", "muscle", "charging", "tone", "hoop", "mountaineering", "subscription", "sambo", "active", "to run", "strap", "fighter", "sparring", "boxing ring", "run away", "tribunes", "musculature", "pionerball", "championship", "surfing", "boxer", "heavyweight", "yoga", "complex", "cyclist", "running start", "stopwatch", "swimmer", "boxers", "locker room", "diving", "weights", "extreme", "jerk", "training", "somersault", "fan", "knockdown", "national team", "the final", "move", "skateboard", "distance", "innings", "scoreboard", "diving", "sway", "lunge", "rewarding", "Instructor", "league", "diet", "ligaments", "springboard", "energy", "rock climbing", "unusual", "throw", "twerking", "pass", "T-shirt", "crossbow", "sway", "dyspnea", "mobility", "running around", "yogi", "rivalry", "bastard", "rope", "draw", "knockout", "gaiters"};
	en_105 = {"movie", "comedy", "horrors", "TV series", "actor", "cinema", "movie", "TV", "popcorn", "thriller", "fantasy", "action movie", "melodrama", "fantasy", "genre", "view", "actress", "drama", "director", "cartoon", "plot", "producer", "ticket", "theatre", "screen", "cartoons", "tragedy", "romance", "people", "role", "poster", "session", "film", "detective", "scenario", "adventure", "Hall", "tape", "camera", "shooting", "inhabitants", "horror", "premiere", "good", "new", "old", "documentary", "hero", "Film Festival", "adventure", "popular science", "row", "a place", "laugh", "cola", "viewer", "operator", "frame", "glasses", "cinema", "cinema hall", "scene", "date", "film", "kiss", "the game", "captions", "artist", "art", "time", "tears", "picture", "sound", "role", "evening", "video", "display", "advertising", "film strip", "fear", "installation", "music", "screenwriter", "staging", "entertainment", "a television", "Hollywood", "shine", "studio", "mosfilm", "filmmaker", "artist", "Oscar", "episode", "heroine", "camcorder", "stuntman", "sight", "fragment", "viewer", "television company", "Studio", "tv channel", "Scenery", "intermission", "cassette", "anime", "superstar", "visit", "form", "short story", "chronicle", "casting", "masterpiece", "sponsor", "visitor", "playwright", "release", "animation", "movie", "story", "cinema art", "song", "sound", "guitar", "rock", "piano", "melody", "notes", "violin", "musician", "singer", "tool", "concert", "jazz", "composer", "headphones", "pop", "orchestra", "listen", "singing", "dance", "opera", "classic", "rap", "Group", "hearing", "play", "drum", "player", "vote", "bang", "rap", "pops", "the flute", "sing", "the words", "the piano", "executor", "note", "piano", "singer", "symphony", "radio", "love", "loud", "rhythm", "loud", "record player", "scene", "sounding", "genre", "vocals", "songs", "cello", "muse", "volume", "accordion", "club", "trumpet", "speakers", "plate", "composition", "soul", "quiet", "microphone", "performance", "bass", "tact", "ballet", "the choir", "clip", "track", "waltz", "compose", "balalaika", "musical", "ears", "classic", "mi", "re", "blues", "disk", "key", "punk", "metal", "style", "album", "conductor", "feelings", "disco", "tambourine", "sounds", "rapper", "chord", "octave", "speaker", "a pipe", "cantata", "quartet", "maestro", "radiola", "party", "harmonic", "speakers", "solfeggio", "play music", "record player", "gramophone", "etude", "a party", "nirvana", "song", "trance", "violinist", "repertoire", "drum", "vinyl", "bow", "keys", "successor", "equipment", "drummer", "neighbors", "anthem", "organist", "strings", "radio", "creativity", "flamenco", "mix", "foxtrot", "stereo tube", "couplet", "choral", "drummer", "in contact with", "play the pipe", "sings", "dance floor", "radio station", "dancer", "nostalgia", "string", "samba", "partying", "listener", "march", "rating", "chart", "rumba", "performer", "aerobics", "dancer", "twist", "range", "casket", "salsa", "repetition", "polka", "dynamics", "drive", "dancing", "lesson", "rhythm", "instrumental", "symphony", "vote", "text", "chorus", "poems", "hit", "composer", "karaoke", "rhyme", "solo", "clip", "record", "stage", "duet", "motive", "star", "mood", "sound recording", "execution", "show", "aria", "soloist", "soloist", "chanson", "soundtrack", "Eurovision", "folk", "chords", "beautiful", "popular", "children’s", "chapel", "ditties", "lullaby", "rhymes", "guitar player", "synthesizer", "baritone", "disco", "round dance", "styles", "talent", "harp", "DJ", "song", "waltz", "tango", "music", "traffic", "disco", "couple", "ballet", "dance", "partner", "ball", "club", "suit", "sambo", "salsa", "rumba", "ballroom", "celebration", "stretching", "dance floor", "hop", "shoes", "dancing", "dancer", "house", "disco", "passion", "folk", "move", "choreographer", "festival", "high school graduation", "casting", "circle", "hobby", "toastmaster", "parquet", "wedding", "flexibility", "occupation", "training", "section", "spark off", "banquet", "dress", "hall", "feast", "competition", "contestants", "tour", "evening", "dancing", "dancing", "paired", "hide and seek", "computer", "children", "play", "chess", "cards", "checkers", "football", "the game", "catch up", "tabletop", "poker", "leisure", "friends", "doll", "Street", "fun", "the yard", "salki", "dominoes", "childhood", "shooting games", "role", "lotto", "excitement", "kindergarten", "toys", "the Internet", "console", "the tablet", "camp", "smartphone", "addiction", "phone", "site", "monitor", "gambling", "olympic", "regulations", "conditions", "monopoly", "sport", "sports", "basketball", "volleyball", "tennis", "golf", "hockey", "children’s", "losing", "lotto", "casino", "player", "team", "victory", "ball", "hide and seek", "fun", "tote", "a toy", "exchange", "to read", "write", "writer", "library", "book", "school", "pages", "literature", "story", "author", "textbook", "book", "reader", "learn", "student", "reading", "the letters", "sheet", "score", "a shelf", "novel", "the words", "circulation", "Bible", "knowledge", "encyclopedia", "poems", "paper", "book", "comfort", "poet", "ABC", "fairy tale", "line", "notebook", "teacher", "detective", "bookmark", "buy", "fantasy", "a shelf", "rack", "textbooks", "librarian", "archive", "shelf", "typography", "waste paper", "backpack", "smart ass", "portfolio", "study", "collection", "philosopher", "education", "polyglot", "magazines", "intellectual", "Exhibition", "holiday", "compilation", "the stories", "allowance", "poetry", "poems", "novels", "cover", "binding", "story", "Tom", "hero", "title", "content", "heading", "chapter", "the science", "poem", "genre", "prose", "publishing house", "publisher", "primer", "edition", "composition", "vocabulary", "mind", "paragraph", "best-seller", "plot", "font", "table of contents", "composition", "the character", "manuscript", "electronic", "interesting", "memoir", "prologue", "epigraph", "title", "paragraph", "instance", "reader", "directory", "co-author", "excerpt", "section", "footnote", "scientific", "illustration", "epic", "review", "the books", "introduction", "prose writer", "foreword", "literary critic", "the narrative", "publication", "count", "knowledge", "quatrain", "review", "rhyme", "U-turn", "retelling", "quotes", "cliche", "introduction", "picture", "artist", "music", "painting", "the museum", "sculpture", "theatre", "drawing", "talent", "creation", "the beauty", "drawing", "movie", "paints", "gallery", "paint", "architecture", "ballet", "literature", "Exhibition", "the culture", "brush", "artificial", "writer", "poet", "landscape", "poetry", "art", "the books", "singing", "a statue", "masterpiece", "portrait", "canvas", "creation", "sculptor", "musician", "composition", "create", "man", "muse", "opera", "composer", "art", "movie", "pencil", "inspiration", "art critic", "design", "monument", "still life", "master", "tassel", "Renaissance", "mastery", "songs", "concert", "a photo", "creator", "graffiti", "easel", "producer", "cinema", "watercolor", "architect", "rebirth", "thoughts", "work", "clay", "oil", "scene", "modern", "fine", "the victims", "artistic", "musical", "restoration", "engraving", "philharmonic society", "origami", "canvas", "product", "sculpt", "statuette", "needlework", "thread", "wood", "creature", "drawings", "etude", "imagination", "column", "exposition", "applique", "caricature", "potter", "portraits", "creator", "coloring book", "cult", "nature", "picture", "contemporary", "Photo", "script", "pattern", "exhibit", "workshop", "conservatory", "china", "the ability", "lyre", "album", "technology", "value", "sketch", "wonderworker", "Sight", "Technics", "sculpture", "architecture", "own", "the game", "have fun", "fun", "recreation", "laugh", "joy", "celebration", "friends", "club", "the park", "smile", "movie", "leisure", "sport", "children", "a party", "enthusiasm", "fun", "the circus", "music", "clowns", "show", "swing", "happiness", "vacation", "booze", "balloons", "bowling", "travel", "pleasure", "attraction", "carousel", "buffoon", "shooting gallery", "ride", "dolphinarium", "aquapark", "rollers", "weekend", "shopping", "diving", "snowboard", "skates", "sled", "extreme", "entertainment", "representation", "jokes", "zoo", "skateboard", "humor", "rink", "joke", "picnic", "swimming pool", "TV series", "bike", "fishing", "rebus", "free", "popular"};
	en_106 = {"physics", "chemistry", "maths", "biology", "knowledge", "school", "scientist", "professor", "scientific", "teaching", "teacher", "study", "learn", "university", "an experience", "story", "study", "book", "opening", "laboratory", "institute", "philosophy", "astronomy", "space", "geography", "experiment", "Technics", "mind", "minds", "to the mind", "progress", "a life", "to study", "formula", "study of", "medicine", "textbook", "thing", "microscope", "thesis", "brain", "newton", "theory", "psychology", "einstein", "bathrobe", "geometry", "invention", "granite", "Job", "man", "lesson", "technology", "people", "smart", "doctor", "algebra", "computer science", "glasses", "mind", "student", "academician", "anatomy", "Lomonosov", "philology", "work", "student", "botany", "botanist", "zoology", "literature", "tongue", "flask", "brain", "diploma", "the prize", "the academy", "hypothesis", "candidate", "art", "power", "to study", "philosopher", "practice", "test tube", "development", "teacher", "accurate", "world", "doctor", "idea", "law", "physicist", "money", "report", "true", "logics", "the department", "nature", "theorem", "genetics", "laboratory assistant", "training", "doctor", "humanitarian", "scientific", "scientific", "employee", "nobel", "natural", "supervisor", "scientists", "master", "monograph", "statistics", "docent", "philologist", "nanotechnology", "methodology", "observatory", "geologist", "phenomenon", "physiology", "phraseology", "heraldry", "trigonometry", "metrics", "doctrine", "expedition", "method", "inventor", "mastering", "chronology", "theorist", "ideology", "thermodynamics", "particles", "term", "terminology", "laboratory assistant", "semantics", "ethics", "experiences", "Mechanics", "reagents", "teachings", "cloning", "neutron", "photon", "mythology", "linguist", "materialism", "proton", "formulas", "gene", "linguistics", "enzyme", "ecologist", "agronomist", "light", "industry", "astronomer", "hybrid", "gravity", "pathology", "symposium", "laureate", "analogy", "graduate school", "graduate student", "magistracy", "education", "and he", "treatise", "nomenclature", "diplomacy", "Zionism", "vector", "orbital", "test tubes", "infusoria", "transcendence", "concept", "the conference", "methodology", "fact", "atheist", "specificity", "hydrocarbon", "educational program", "journalism", "unicellular", "navigation", "society", "the concept", "wisdom", "paradox", "isotope", "textbooks", "arithmetic", "zootechnics", "observation", "the atoms", "robots", "inclination", "breakthrough", "idiom", "structure", "worldview", "modern", "historical", "logics", "doctor", "proved", "evidence", "to engage", "fundamental", "academic", "applied", "empirical", "Professor", "plants", "the science", "lesson", "man", "thing", "school", "nature", "animals", "plants", "teacher", "anatomy", "biologist", "botany", "a life", "cell", "textbook", "bacteria", "mushrooms", "zoology", "microscope", "chemistry", "insects", "fauna", "people", "germs", "Flora", "exam", "organism", "pestle", "stamen", "the flowers", "bodies", "evolution", "learn", "mammals", "skeleton", "genetics", "birds", "assessment", "student", "kingdom", "photosynthesis", "land", "to study", "animal", "medicine", "book", "an experience", "body", "wood", "ecology", "breeding", "a heart", "fish", "the class", "grass", "study of", "dna", "amoeba", "animals", "blood", "structure", "laboratory", "world", "brain", "living", "frog", "development", "physiology", "natural science", "microorganism", "water", "nucleus", "Darwin", "death", "biological", "microbiology", "view", "chromosome", "genes", "Wednesday", "biochemistry", "cytology", "experiments", "forest", "virus", "bones", "botanist", "molecule", "research", "Flora", "synthesis", "anabiosis", "cells", "enzyme", "bacterium", "membrane", "hybrid", "microbe", "mutation", "white blood cells", "cellulose", "red blood cells", "secretion", "cellulose", "individual", "the molecules", "microparticles", "reflex", "plant", "segment", "carbohydrates", "receptor", "touch", "nerve", "paragraph", "classification", "heredity", "test tubes", "muscles", "joint", "instinct", "hypothesis", "organ", "ribs", "method", "artery", "fetus", "breeder", "stomach", "decomposition", "chloroform", "division", "spine", "cell", "phase", "muscle", "circulation", "experiment", "variety", "amphibian", "hormone", "the roots", "moss", "muscles", "reaction", "plankton", "ideology", "intestine", "lily of the valley", "substance", "Professor", "digestion", "shin", "bush", "bud", "theory", "particle", "diaphragm", "formula", "appendix", "solution", "family", "fern", "shell", "microbiology", "engineering", "biophysics", "molecular", "evolutionary", "region", "cell", "doctor", "hospital", "disease", "a life", "man", "healthy", "medicines", "doctor", "tablets", "food", "vitamins", "a heart", "body", "run", "medicine", "pharmacy", "fruits", "food", "charging", "pain", "vegetables", "treatment", "the beauty", "strong", "cold", "clinic", "sleep", "force", "well-being", "an injection", "cancer", "air", "old age", "immunity", "get sick", "death", "fitness", "youth", "treat", "nurse", "gymnastics", "diet", "organism", "state", "ENT", "mode", "sick", "hygiene", "smoking", "thermometer", "temperature", "sick leave", "prevention", "bodies", "physical Culture", "healthy", "flu", "blood", "analyzes", "keep safe", "liver", "injury", "surgeon", "first aid kit", "be treated", "operation", "harm", "the kidneys", "tone", "the healer", "breath", "lungs", "quenching", "temper", "follow", "purity", "pressure", "sanatorium", "ambulance", "form", "recovery", "recovery", "worsening", "vision", "cure", "yoga", "cardiogram", "sick", "ration", "smoker", "alcoholic", "alcoholism", "avitaminosis", "vaccine", "vaccination", "garlic", "tooth", "stamotologist", "paste", "abuse", "medicine", "self preservation", "insurance", "examination", "pulse", "heredity", "diagnostics", "diagnosis", "an exercise", "x-ray", "fluorography", "penicillin", "muscles", "calcium", "teeth", "a drug", "rehabilitation", "stroke", "heart attack", "disease", "consultation", "therapy", "statement", "maternity hospital", "strengthening", "weakness", "affliction", "irradiation", "threat", "health", "ultrasound", "ECG", "mr", "analysis", "the reception", "mental", "hearing", "ENT", "ophthalmologist", "therapist", "gynecologist", "preparations", "doctor", "dropper", "bathrobe", "Ward", "free", "recipe", "clinic", "medic", "syringe", "neurology", "physiotherapy", "unconventional", "to heal", "healing", "miracle", "neurologist", "endocrinologist", "gastroenterologist", "otolaryngologist", "health", "gene", "heredity", "hybrid", "genes", "mutation", "dna", "mutant", "biology", "cloning", "breeder", "evolution", "the science", "origin", "generation", "study", "physiology"};
}

void CalculateRuDatabase() {
	string buff;
	vector<string> arr;

	arr = ru_002;
	for (string item : arr) {
		buff = item;
		buff.append("а");
		ru_002.push_back(buff);
		buff = item;
		buff.append("и");
		ru_002.push_back(buff);
	}

	arr = ru_003;
	for (string item : arr) {
		buff = item;
		buff.append("ла");
		ru_003.push_back(buff);
		buff = item;
		buff.append("ли");
		ru_003.push_back(buff);
	}

	arr = ru_004;
	for (string item : arr) {
		buff = item;
		buff.append("ся");
		ru_004.push_back(buff);
		buff = item;
		buff.append("ась");
		ru_004.push_back(buff);
		buff = item;
		buff.append("ись");
		ru_004.push_back(buff);
	}
}

void PrepareDatabase() {
	ReadRuDatabase();
	CalculateRuDatabase();
	// print(ru_001);
	// print(ru_002);
	// print(ru_003);
	// print(ru_004);
}

bool IsItemInArray(vector<string> arr, string str) {
	for (string item : arr) {
		if (item == str) {
			return true;
		}
	}
	return false;
}

bool IsItemInArray(vector<int> arr, int i) {
	for (int item : arr) {
		if (item == i) {
			return true;
		}
	}
	return false;
}

bool GetNews(string lang, string text, vector<string> words) {
	int news = 0;
	int buff;
	bool result;

	if (lang == "ru") {
		for (string item : ru_001) {
			buff = text.find(item);
			if (buff > 0) {
				news = news + 2;
				// cout << "news +2: " << item << endl;
			}
		}
		for (string item : ru_002) {
			result = IsItemInArray(words, item);
			if (result) {
				news = news + 1;
				// cout << "news +1: " << item << endl;
			}
		}
		for (string item : ru_003) {
			result = IsItemInArray(words, item);
			if (result) {
				news = news + 1;
				// cout << "news +1: " << item << endl;
			}
		}
		for (string item : ru_004) {
			result = IsItemInArray(words, item);
			if (result) {
				news = news + 1;
				// cout << "news +1: " << item << endl;
			}
		}
	}
	else if (lang == "en") {
		for (string item : en_001) {
			buff = text.find(item);
			if (buff > 0) {
				news = news + 2;
				// cout << "news +2: " << item << endl;
			}
		}
		for (string item : en_002) {
			result = IsItemInArray(words, item);
			if (result) {
				news = news + 1;
				// cout << "news +1: " << item << endl;
			}
		}
		for (string item : en_003) {
			result = IsItemInArray(words, item);
			if (result) {
				news = news + 1;
				// cout << "news +1: " << item << endl;
			}
		}
		for (string item : en_004) {
			result = IsItemInArray(words, item);
			if (result) {
				news = news + 1;
				// cout << "news +1: " << item << endl;
			}
		}
	}
	int cnum = Count(text, ".");
	// cout << news << "/" << cnum << endl;
	if (news>cnum/2) {
		return true;
	}
	else {
		return false;
	}
}

string GetThemes(string lang, string text, vector<string> words) {
	int buff;
	int society = 0;
	int economy = 0;
	int technology = 0;
	int sports = 0;
	int entertainment = 0;
	int scince = 0;
	bool result;
	
	if (lang == "ru") {
		for (string item : ru_101) {
			result = IsItemInArray(words, item);
			if (result) {
				society = society + 1;
				// cout << "society: " << item << endl;
			}
		}
		for (string item : ru_102) {
			result = IsItemInArray(words, item);
			if (result) {
				economy = economy + 1;
				// cout << "economy: " << item << endl;
			}
		}
		for (string item : ru_103) {
			result = IsItemInArray(words, item);
			if (result) {
				technology = technology + 1;
				// cout << "technology: " << item << endl;
			}
		}
		for (string item : ru_104) {
			result = IsItemInArray(words, item);
			if (result) {
				sports = sports + 1;
				// cout << "sports: " << item << endl;
			}
		}
		for (string item : ru_105) {
			result = IsItemInArray(words, item);
			if (result) {
				entertainment = entertainment + 1;
				// cout << "entertainment: " << item << endl;
			}
		}
		for (string item : ru_106) {
			result = IsItemInArray(words, item);
			if (result) {
				scince = scince + 1;
				// cout << "scince: " << item << endl;
			}
		}
	}
	else if (lang == "en") {
		for (string item : en_101) {
			result = IsItemInArray(words, item);
			if (result) {
				society = society + 1;
				// cout << "society: " << item << endl;
			}
		}
		for (string item : en_102) {
			result = IsItemInArray(words, item);
			if (result) {
				economy = economy + 1;
				// cout << "economy: " << item << endl;
			}
		}
		for (string item : en_103) {
			result = IsItemInArray(words, item);
			if (result) {
				technology = technology + 1;
				// cout << "technology: " << item << endl;
			}
		}
		for (string item : en_104) {
			result = IsItemInArray(words, item);
			if (result) {
				sports = sports + 1;
				// cout << "sports: " << item << endl;
			}
		}
		for (string item : en_105) {
			result = IsItemInArray(words, item);
			if (result) {
				entertainment = entertainment + 1;
				// cout << "entertainment: " << item << endl;
			}
		}
		for (string item : en_106) {
			result = IsItemInArray(words, item);
			if (result) {
				scince = scince + 1;
				// cout << "scince: " << item << endl;
			}
		}
	}
	
	// cout << "society: " << society << endl;
	// cout << "economy: " << economy << endl;
	// cout << "technology: " << technology << endl;
	// cout << "sports: " << sports << endl;
	// cout << "entertainment: " << entertainment << endl;
	// cout << "scince: " << scince << endl;
	if (society>economy && society>technology && society>sports && society>entertainment && society>scince) {
		return "society";
	}
	else if (economy>society && economy>technology && economy>sports && economy>entertainment && economy>scince) {
		return "economy";
	}
	else if (technology>society && technology>economy && technology>sports && technology>entertainment && technology>scince) {
		return "technology";
	}
	else if (sports>society && sports>economy && sports>technology && sports>entertainment && sports>scince) {
		return "sports";
	}
	else if (entertainment>society && entertainment>economy && entertainment>technology && entertainment>sports && entertainment>scince) {
		return "entertainment";
	}
	else if (scince>society && scince>economy && scince>technology && scince>sports && scince>entertainment) {
		return "scince";
	}
	else {
		return "other";
	}
}

class Docs {
	public:
		int id;
		string fname;
		string content;
		string title;
		string text;
		string lang;
		bool isnews;
		string theme;
		vector<string> words;
		vector<int> groups;

		void calculate() {
			content = ReadFile(fname);
			title = GetTitle(content);
			text = GetClearText(content);
			lang = GetLanguage(text);
			if (lang != "ru" && lang != "en") {
				return;
			}

			words = GetWords(text);
			isnews = GetNews(lang, text, words);
			if (isnews == false) {
				return;
			}

			theme = GetThemes(lang, text, words);
		}
	private:
		float average_ball;
};

void AddDocsToArray(vector<Docs>& docs, string& fname) {
	Docs doc;
	doc.id = docs.size();
	doc.fname = fname;
	

	doc.calculate();
	docs.push_back(doc);
	print("--- --- ---");
	print(doc.id);
	print(doc.words.size());
}

void Group(vector<Docs>& docs, Docs& doc) {
	bool result;

	print("+++ +++ +++");
	print(doc.id);
	print(doc.words.size());

	for (Docs chdoc : docs) {
		result = IsItemInArray(doc.groups, chdoc.id);
		if (result) {
			continue;
		}

		for (string word : doc.words) {
			result = IsItemInArray(chdoc.words, word);
			if (result) {
				doc.groups.push_back(chdoc.id);
				//cout << doc.id << " +" << chdoc.id << endl;
			}
		}
	}
}

void Grouping() {
	clock_t start, stop;

	print("start initialization");
	start = clock();
	vector<Docs> docs;
	vector<string> filelist = ReadDirectory("source_dir");
	print(filelist.size());
	for (string fname : filelist) {
		AddDocsToArray(docs, fname);
	}
	stop = clock();
	printf("Loop required %f seconds\n", (double)(stop - start) / CLOCKS_PER_SEC);

	print("start grouping");
	start = clock();
	for (Docs doc : docs) {
		Group(docs, doc);
	}

	stop = clock();
	printf("Loop required %f seconds\n", (double)(stop - start) / CLOCKS_PER_SEC);
}

void Ranging() {
	
}


///
/// Start of the program
///

int main() {
	PrepareDatabase();
	// int i = 0;
	// string fname = "source_dir/20191101/00/646211304670367566.html";
	// string fname = "source_dir/20191101/00/993065344121705.html";
	// string fname = "source_dir/20191101/00/7659932480825610.html";
	// WorkingWithFile(fname, i);

	// vector<string> filelist = ReadDirectory("source_dir");
	// print(filelist);
	// print(filelist.size());

	// for (string fname : filelist)
	// {
	// 	WorkingWithFile(fname, i);
	// }
	

	// Docs doc;
	// doc.fname = fname;
	// doc.calculate();
	// print(doc.isnews);
	// print(doc.theme);

	Grouping();
	

	return 0;
}
